{
  "count": 50,
  "timestamp": "2025-04-23T21:02:08.121154",
  "news": [
    {
      "headline": "Institutions break up with Ethereum but keep ETH on the hook",
      "summary": "Ethereum is entering one of its most precarious periods since its inception. Usage on the base layer is plummeting, core metrics are nearing multi-year lows, and even co-founder Vitalik Buterin is proposing a radical architectural overhaul. Institutions aren’t waiting to see how it plays out. Blockchain data shows that long-time supporters such as Galaxy Digital and Paradigm have been slashing their Ether (ETH) holdings in recent weeks. So far in April, Ethereum’s base-layer activity has continued to collapse. Ethereum’s network fees are dropping, and inflation has been rising. Though layer-2 networks continue to develop, they’re cannibalizing the base layer’s value capture.But the story isn’t entirely about Ethereum’s collapse. Some whales are treating this downturn as a rare buying opportunity. Even those who are selling Ether can’t fully let it go.Ethereum gets dumped by institutions, but for how long?Institutions are dumping Ethereum, but it’s the ex they keep checking on. It’s not entirely out of the picture — just benched while they explore options like Solana (SOL).In recent weeks, blockchain analysts on the lookout for large crypto movements spotted several institutions moving ETH out of their tagged wallets, likely to sell. Lookonchain reported that Galaxy Digital deposited 65,600 ETH ($105.5 million) to Binance. The investment firm’s Ether exposure rose to as high as around 98,000 coins in February, but that has dropped to almost 68,000 ETH at the time of writing, Arkham data shows.Galaxy dumps Ether, but not all of it. Source: ArkhamGalaxy’s holdings may have declined in recent weeks, but they’re still higher compared to the start of the year. Its Ether holdings reflect a broader trend seen in Ethereum-based investment products. According to CoinShares, ETH funds saw $26.7 million in outflows over the past week, bringing total outflows to $772 million over eight weeks. However, year-to-date flows remain positive, with $215 million in net inflows. As Galaxy trimmed its Ether holdings, it also withdrew 752,240 SOL ($98.37 million), Lookonchain reported. Ethereum lost considerable momentum to Solana, which became the chain of choice during the memecoin casino frenzy that dominated much of 2024 and early 2025. While that eventually cooled amid rampant scams, bots and low-quality tokens, it also served as a technical showcase for Solana — proving its ability to process massive transaction volumes without major fee spikes or outages.Related: Pump.fun’s memecoin freak show may result in criminal charges: ExpertParadigm is another investor that has cut back on Ether. On April 21, it moved 5,500 ETH ($8.66 million) to Anchorage Digital. Paradigm transferred around 97,000 ETH (around $301.57 million) to Anchorage from January 2024, which was then moved to centralized exchanges, as onchain analyst EmberCN pointed out.Paradigm Capital held about 236,000 ETH in 2019 but holds 2,873 ETH on April 23. Source: Arkham“While institutional investors initially bought into the ‘ultra-sound money’ narrative, they’re now facing a reality where decreasing protocol revenue and weakening tokenomics create legitimate concerns,” Jayendra Jog, co-founder of Sei Labs, told Cointelegraph.Ethereum returns to net inflationary stateEther deflation has been an attractive selling point to Ethereum investors. It was integrated into the network through two major upgrades. First, the London hard fork of August 2021 introduced Ethereum Improvement Proposal 1559, which partially burns transaction fees. Then in the Merge upgrade of September 2022, Ethereum became a proof-of-stake network and drastically cut new token issuance.Ether’s supply consistently decreased following the Merge until April 2024, when Ether’s inflation began to accelerate. By early February 2025, the total ETH supply had surpassed its Merge level.Ether’s total supply is approximately 186,705 ETH higher than it was at the time of the Merge. Source: Ultra Sound MoneyPart of Ether’s inflation has been due to dropping fees, which results in less Ether burned. According to data from IntoTheBlock, Ethereum collected 1,873.52 ETH in fees from April 14 to April 21. That’s slightly higher than the 1,697.61 ETH in fees from the week starting on March 17, which was the lowest amount of fees collected (measured in ETH) since July 31, 2017.Ethereum base layer’s fees drop to 2017 levels. Source: IntoTheBlockButerin’s radical RISC-V proposal for EthereumOn April 20, Buterin proposed the RISC-V instruction set to substitute the current Ethereum Virtual Machine contract language, aiming to improve the speed and efficiency of the network’s execution layer. Some view the proposal as a white flag on the existing architecture.Source: Rooter“Vitalik’s RISC-V proposal is essentially an acknowledgment that the EVM’s fundamental architecture has reached its limits. When Ethereum’s founder proposes replacing the core VM that underpins the entire ecosystem, it signals not evolution but recognition of a design limitation that can’t be incrementally improved,” Jog said.Cointelegraph has reached out to the Ethereum Foundation and will update this article when it answers.Related: A guide to crypto trading bots: Analyzing strategies and performanceThe proposal follows a leadership shuffling in the Ethereum Foundation following rising complaints on the project’s direction. Could Ethereum be the one that got away?Part of Ethereum’s struggles has been attributed to its rollup-centric approach to scaling its network. The idea was to build layer-2 scaling networks that would offload the transactions from the base chain but still utilize its security. That has alleviated congestion issues during times of high network demand but has also created new problems of its own, such as dropping Ether burns and fragmentation of the Ethereum ecosystem.But there is an increased focus on layer-1 scaling, according to Tomasz Stańczak, the new co-executive director of the Ethereum Foundation. Stańczak said on X that the Ethereum Foundation will shift its focus to near-term goals, such as layer-1 scaling and layer-2 scaling support.Source: Tomasz StańczakSome whales have taken advantage of Ethereum’s cheaper price tag. On April 23, Lookonchain identified two wallets accumulating millions of dollars worth of ETH. The blockchain monitor identified another wallet on April 22 that has accumulated over $100 million in ETH since Feb. 15. Ether is currently down from the plus-$4,000 it reached in December but rose over 10% on April 23 to over $1,800. In a recent client letter, Standard Chartered Bank slashed its 2025 price estimate for Ether from $10,000. However, for whales accumulating at current levels, upside potential remains, as the bank still predicts a year-end target of $4,000.Geoff Kendrick, the bank’s head of digital assets research, attributed the more cautious outlook to Ethereum’s structural decline, noting that the layer-2 networks designed to improve scalability are now extracting much of the fee revenue once captured by the base layer.Magazine: What are native rollups? Full guide to Ethereum’s latest innovation",
      "url": "https://cointelegraph.com/news/institutions-breakup-ethereum-keep-eth-on-hook?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745420996,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474890
    },
    {
      "headline": "What are XRP futures and how to invest in them?",
      "summary": "If you’re following developments in the cryptocurrency market, you’ve likely noticed that Coinbase Derivatives has introduced XRP futures contracts to its US derivatives exchange. This move is part of a broader trend where regulated platforms are expanding access to futures trading, giving investors new ways to engage with digital assets like XRP (XRP).But what exactly are XRP futures? And how do you get involved as an investor or trader?Let’s take a closer look.What are XRP futures?XRP futures are standardized financial contracts that allow you to agree to buy or sell XRP at a predetermined price on a specific future date. Rather than trading the actual token, you’re trading a contract that tracks the price of XRP.These contracts are overseen by the US Commodity Futures Trading Commission (CFTC), meaning they operate within a regulated framework. That adds a level of oversight and structure that appeals to many investors, particularly those wary of the risks tied to unregulated platforms.On April 3, 2025, Coinbase Derivatives announced it had filed with the CFTC to self-certify XRP futures contracts, and the contracts were launched on April 21, 2025.Types of XRP futures contracts offered by CoinbaseCoinbase’s offering includes:Nano XRP futures represent 500 XRP per contract, cash-settled in US dollars. These are designed for retail traders and smaller institutions, offering lower capital requirements while still providing exposure to XRP price movements.Standard XRP futures cover 10,000 XRP per contract, are also settled in USD, and are aimed at larger institutions and active traders.This variety lets you choose a position size that matches your risk tolerance and investment strategy. But what do terms like “cash-settled” actually mean?Both Nano and Standard XRP futures are contracts that let you trade based on the price of XRP — but you don’t actually own or receive XRP. You’re trading contracts that track XRP’s price.And, when the contract closes, the difference between your entry and exit price is calculated (profit or loss) and settled in USD — this is what cash settlement means. Did you know? Other products offered by the Coinbase Derivatives exchange include more than 20 futures contracts on assets such as Bitcoin (BTC), Ether (ETH), Dogecoin (DOGE), Solana (SOL), Chainlink (LINK) and Stellar (XLM).Why choose XRP futures contracts over buying XRP?You might be wondering why someone would choose futures over simply buying XRP on the spot market.Here are a few reasons:Leverage: Futures often allow you to control a large position with a relatively small amount of capital. While this can amplify gains, it also increases potential losses.Hedging: If you already hold XRP and expect short-term volatility, futures can be used to protect your portfolio.Speculation: Futures allow you to take both long (bullish) and short (bearish) positions, so you can potentially benefit from market moves in either direction.No wallet or storage needs: Buying XRP requires a secure wallet and managing private keys, which carries risks like hacking or loss. Futures contracts are financial instruments traded on exchanges, eliminating the need for direct XRP custody.Liquidity and accessibility: Futures markets often have high liquidity, making it easier to enter and exit positions. Some exchanges offer XRP futures with lower barriers than buying XRP on certain crypto platforms, especially in regions with regulatory restrictions.Cash settlement: Many XRP futures are cash-settled, meaning you settle profits or losses in fiat or stablecoins without handling XRP itself, simplifying the process for traders avoiding crypto custody.When to choose futures contracts:You want to trade XRP price movements with leverage or flexibility to go long or short.You prefer not to deal with crypto wallets or custody.You’re hedging an existing XRP position or portfolio.You’re comfortable with the risks and complexities of derivatives.When to buy XRP:You believe in XRP’s long-term value and want to hold it as an investment.You plan to use XRP for transactions or in its ecosystem (e.g., Ripple’s payment network).You want to avoid the risks of leverage and futures margin calls.Ultimately, futures suit active traders or those seeking leveraged exposure, while buying XRP could be ideal for long-term holders or users of the asset. You must always assess your risk tolerance and goals before deciding whether to invest in XRP or XRP futures.Did you know? The MarketVector™ Coinbase XRP Benchmark Rate provides a robust USD price reference exclusively for XRP traded on the Coinbase Exchange. It includes no other assets and no other exchanges — just XRP, just Coinbase.Where to invest in XRP futuresIf you’re looking to invest in XRP futures, there are several platforms (other than Coinbase) offering access depending on your location and trading needs.Kraken Futures: Kraken provides XRP futures with leverage. In Australia, access is limited to wholesale clients through Beaufort Fiduciaries Pty Ltd (AFSL no. 545124). In the United Kingdom, only clients classified as Professional Clients under Financial Conduct Authority rules can trade through Crypto Facilities Limited (FRN: 757895).Binance: Binance offers XRP/USDT perpetual futures contracts, allowing users to trade XRP without an expiry date. These contracts support leverage, giving traders flexibility in managing exposure. However, as of May 28, 2024, Binance no longer supports XRP as a margin asset under its “Multi-Assets Mode,” though XRP futures remain available in other trading modes.OKX: OKX also provides XRP/USDT perpetual swaps, which let traders speculate on XRP price movements continuously. While OKX delisted XRP expiry futures contracts in December 2024, perpetual swaps are still supported. Traders can apply leverage and adjust positions based on their risk strategy.Bitget: It is a globally accessible platform that offers XRP futures with options to take long or short positions. It features a user-friendly interface, making it suitable for both new and experienced traders, though availability depends on regional regulations.KuCoin Futures: KuCoin supports XRP perpetual contracts (XRP/USDT) with leverage. The platform is known for low trading fees and offers various features for different trading strategies. It’s accessible in many countries, with some regional restrictions.MEXC: It provides XRP futures in both USDt-margined and coin-margined formats. MEXC supports high leverage and offers educational tools, catering to traders of all levels. The platform is available in most regions, though users should check for local compliance.Delta Exchange: It lists XRP perpetual futures with leverage up to 100x. It’s known for low fees and advanced risk management tools. The platform is available to traders in several countries, depending on local laws.Bitfinex: Lastly, Bitfinex offers XRP futures as part of its broader derivatives portfolio. Its platform caters to advanced users with customizable strategies. Access is region-dependent, and traders must ensure eligibility based on their location.Did you know? Coinbase crypto derivatives are not available to retail clients based in the United Kingdom or Spain due to local regulatory restrictions. How to invest in XRP futures If you’re interested in trading XRP futures, here are general steps to get started:Choose a platform: Select a regulated exchange offering XRP futures, such as Coinbase’s US Derivatives Exchange. Create an account and complete identity verification, which typically involves submitting a valid ID and proof of address.Understand the product: Research how XRP futures contracts work, including contract sizes (e.g., Coinbase offers standard contracts of 10,000 XRP or nano contracts of 500 XRP), margin requirements, leverage options and fees. Futures are complex, so review the exchange’s documentation and understand risks, such as liquidation.Fund your account: Deposit USD or another accepted currency to use as collateral (margin) for trading. Check the platform’s minimum deposit and margin requirements. For example, Coinbase settles futures in USD, and you can fund via bank transfer or debit card.Place your trade: Use the platform’s trading interface (e.g., Coinbase Advanced) to select XRP futures contracts (symbol: XRL for standard XRP contracts on Coinbase). Decide whether to go long (buy) or short (sell), set your position size, and apply any leverage if available. Confirm the trade after reviewing details.Practice risk management: Futures carry high risks due to leverage and volatility. Set stop-loss orders, limit position sizes based on your risk tolerance, and avoid risking more than you can afford to lose. For instance, some exchanges pause trading if the underlying asset’s price moves over 10% in an hour to mitigate volatility risks.Monitor the market: Track XRP’s price, market sentiment, funding rates and external factors like regulatory news or macroeconomic trends. Use tools like candlestick charts or technical indicators on the platform to inform your strategy. Stay updated to adjust positions and avoid unexpected losses.Oregon targets Coinbase over XRP, cites securities violationsOregon’s Attorney General has sued Coinbase, claiming the exchange offered unregistered securities, including XRP. The lawsuit argues that a wide range of digital assets traded on the platform qualify as investment contracts under state law.State officials say the case is part of a broader effort to step in where federal enforcement has pulled back. Legal experts note that while the outcome won’t set a national precedent, it could influence how regulators and courts approach similar cases.The timing is notable — just weeks after the SEC dropped its case against Ripple and days after Coinbase listed XRP futures on its US derivatives exchange.Did you know? On March 25, 2025, Ripple Labs settled its long-standing legal dispute with the SEC. As part of the agreement, Ripple consented to pay a reduced fine of $50 million — down from the original $125 million — without admitting any wrongdoing.How risky are crypto futures?Futures trading offers opportunities, but it comes with significant risks — especially if you’re new to derivatives. Here’s what you should keep in mind:Leverage risk: While leverage can increase your returns, it also amplifies losses. A small price move in the wrong direction can quickly deplete your account.Volatility: XRP is known for its sharp price swings. Futures contracts can exaggerate the impact of volatility on your position.Funding rates: Perpetual futures contracts charge periodic funding fees, which can eat into profits if held long-term.Liquidation: If the market moves against you and your margin falls below the required level, your position may be automatically closed — often at a loss.Complexity: Futures are more complicated than spot trading. Understanding contract terms, funding rates and expiry dates is crucial to managing your trades effectively.Market liquidity: While XRP is a liquid asset, futures trading depends on active participation. Thin order books can lead to slippage and unexpected price movements.Emotional pressure: The fast-paced nature of futures trading can lead to impulsive decisions. Discipline and a clear strategy are essential.If you’re new to this type of trading, consider starting with a demo account or using nano contracts to reduce your exposure while you learn. Trade smart — your safety’s on you!This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.",
      "url": "https://cointelegraph.com/news/what-are-xrp-futures-and-how-to-invest-in-them?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745420424,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474891
    },
    {
      "headline": "Blockchain prediction markets offer new hope for scientific validation",
      "summary": "Opinion by: Sasha Shilina, PhD, founder of Episteme and researcher at Paradigm Research InstituteDecentralized prediction markets are gaining ground in the scientific world, offering an intriguing answer to the field’s ongoing reproducibility crisis. While a notable share of research findings fail to replicate in independent tests, supporters believe market-driven forecasting can speed up identifying robust studies. Detractors remain cautious, worried that introducing financial wagers could compromise the measured, peer-reviewed process that has guided academic inquiry for centuries. The debate hinges on whether blockchain-based forecasting will elevate or destabilize scientific credibility.Crowdsourcing predictionsDespite these concerns, recent developments point toward real promise. Platforms like Polymarket and Pump.science have shown that crowdsourcing predictions can help refine collective judgment in fields as varied as politics and longevity. This model is being adapted for science, where it could quickly flag dubious claims and reward reproducible ones. Although critics highlight potential market manipulation, decentralized science (DeSci) advocates argue that broad participation from multiple stakeholders could democratize the validation process, discouraging one-sided interventions by well-funded groups.The crux of the pro-market argument is the possibility of financial accountability for flawed or exaggerated studies. Under the conventional system, questionable research can remain influential for years before its shortcomings come to light. Market-based validation turns that dynamic on its head, issuing direct financial losses to those who bet on shaky findings. Of course, the same mechanism allows for the “shorting” of credible but lesser-known work. Supporters note, however, that transparent market structures and robust liquidity can mitigate the worst effects of speculation, putting a welcome dose of rigor back into funding decisions and public trust.Regulations and complexitiesRegulatory scrutiny adds a layer of complexity. Some jurisdictions still classify prediction markets as gambling or derivatives, limiting their growth without specialized approvals. The early experience of platforms like Augur underscores how legal uncertainties can dampen mainstream engagement. Recent shifts in digital asset regulation and greater public interest in scientific accountability suggest that, with the proper framework, a path toward legitimacy is possible. Proponents see this as an opportunity for policymakers to differentiate between purely speculative markets and those with clear societal benefits, such as improving research standards.Knowledge frameworksData integrity is another obstacle that innovators are tackling head-on. Oracles, which feed external results into blockchains, remain a weak link if they rely on unverified or manipulated sources. More advanced AI oracle networks are incorporating multiple data feeds and transparent auditing processes to overcome this. This, in turn, incentivizes labs and journals to adopt higher data reporting standards, knowing that the market’s collective intelligence would quickly expose fraudulent or incomplete information.Recent: Bitcoin price prediction markets bet BTC won't go higher than $138K in 2025Some experts remain unconvinced that prediction markets alone can outperform traditional peer review. After all, scientific publication is based on specialized expertise, and markets often rely on overlapping pools of experts who may carry existing biases. Yet others counter that the financial incentive can serve as a powerful accelerant for truth, ensuring that the possibility of monetary loss balances any conflict of interest. Rather than replacing peer review, prediction markets could operate in parallel, catching oversight or misconduct that slips through editorial filters.For advocates, this blend of market-driven oversight and decentralized participation holds the greatest promise. With a growing number of platforms willing to host questions on scientific claims and major institutions increasingly alarmed by irreproducible research, the stage is set for a new era of rigorous public validation. The outcome remains uncertain, but the core idea — that a small bet can spark a significant reckoning — has won over many open-science supporters and decentralized finance innovators. If blockchain-based prediction markets continue to mature, they may become a key ally in restoring scientific credibility, offering a faster, more transparent form of discovery.Opinion by: Sasha Shilina, PhD, founder of Episteme and researcher at Paradigm Research Institute. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
      "url": "https://cointelegraph.com/news/blockchain-prediction-markets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745420400,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474892
    },
    {
      "headline": "Floki Teams With Softbank Partner Rice Robotics for Tokenization of AI Data",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/floki-teams-with-softbank-partner-rice-robotics-for-tokenization-of-ai-data",
      "source": "CoinDesk",
      "datetime": 1745417872,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/20301958ba40938c016ef364f91e50391d06fff4-1383x787.png?auto=format",
      "category": "crypto",
      "id": 7474887
    },
    {
      "headline": "Galaxy , CoreWeave Expand Alliance With Data Center Expansion",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/galaxy-coreweave-expand-alliance-with-data-center-expansion",
      "source": "CoinDesk",
      "datetime": 1745417762,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/05b546743c9c24f4091cece89ebaf7fad410651a-5616x3159.jpg?auto=format",
      "category": "crypto",
      "id": 7474888
    },
    {
      "headline": "Maple Finance CEO Sidney Powell on Building the DeFi-Bond Bridge",
      "summary": "",
      "url": "https://www.coindesk.com/consensus-toronto-2025-coverage/2025/04/23/maple-finance-ceo-sidney-powell-on-building-the-defi-bond-bridge",
      "source": "CoinDesk",
      "datetime": 1745417461,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/55b09143a8926f8c88b1343ede7bce20fb2ca89f-1600x920.jpg?auto=format",
      "category": "crypto",
      "id": 7474889
    },
    {
      "headline": "PayPal to offer 3.7% yield on stablecoin balances: Report",
      "summary": "Payments behemoth PayPal plans to offer a 3.7% yield on balances held in its PayPal USD stablecoin.According to an April 23 Bloomberg report, a PayPal representative said that the measure aims to encourage more usage of the firm’s stablecoin. The new program is purportedly expected to launch this summer, and the rewards will also be paid out in PayPal USD (PYUSD).Users will be able to exchange PYUSD for fiat currency, spend it, or send it to other users. The rewards will accrue daily and will be paid on a monthly basis. Jose Fernandez da Ponte explained that the company hopes this feature will lead to a higher predominance of stablecoin and crypto payments on its platform.The report follows PayPal USD reaching a $1 billion market cap in the summer of 2024. As of publication, the stablecoin’s market cap is nearly a quarter lower at $873.3 million.PayPal USD’s market cap chart. Source: CoinMarketCapTzahi Kanza, CEO of crypto investment firm Syndika, told Cointelegraph that “from a regulatory standpoint, PayPal must ensure that offering interest doesn’t cause its stablecoin to be classified as a security.“ When it comes to financial risks for the users, he believes that PayPal can keep its promises, and the main risk is still losing the peg to the dollar and not interest-related issues. He said:“Stablecoins that don’t offer yield are generally not considered securities. However, yield-bearing stablecoins may fall under that classification.”Related: PayPal's Xoom launches cross-border stablecoin settlementPayPal is betting on cryptoPayPal is betting on blockchain technology with its continued product development. Reports from earlier in April show that PayPal has expanded its cryptocurrency offerings to include Chainlink (LINK) and Solana (SOL), giving US-based users the ability to buy, sell and transfer the popular tokens.In fact, PayPal was cited by Polygon Labs CEO Marc Boiron as one of the catalysts for the stablecoin industry’s rapid growth in recent years. In an interview with Cointelegraph, Boiron said, “Companies like Stripe and PayPal integrating stablecoins is likely the primary catalyst for their growth.”Related: PayPal, Ernst & Young settle first corporate payment via PYUSD stablecoinThe story of PayPal USDPYUSD is a US dollar-pegged stablecoin issued by Paxos Trust Company on behalf of PayPal in August 2023. At the time of the launch, PayPal became the first major payment network to launch its own stablecoin, with Venmo rolling out support in September 2023.Each token is purportedly backed one-to-one by cash deposits, short-term US Treasury notes and similar cash-equivalent assets in accounts overseen by the New York State Department of Financial Services. Initially, PYUSD was a token compliant with the ERC-20 Ethereum standard, but has since also been deployed on Solana (SOL).PayPal USD’s current market cap is still a far cry from the top stablecoin, Tether’s USDt (USDT). At the time of writing, CoinMarketCap data shows that USDT’s market cap stands at $145.32 billion, over 17,255% higher than PYUSD’s. Kanza said that “Tether’s strength lies in its market dominance — not in its regulatory compliance, transparency, or yield” since it does not offer those. He added:“To compete effectively, targeting these three areas — compliance, transparency and returns — would be a smart strategy [for PayPal.]“Magazine: Chinese Tether laundromat, Bhutan enjoys recent Bitcoin boost: Asia Express",
      "url": "https://cointelegraph.com/news/paypal-stablecoin-pyusd-yield-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745416441,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474846
    },
    {
      "headline": "Here’s how HEX’s Richard Heart beat SEC fraud charges",
      "summary": "Richard Heart, the controversial founder of HEX, is claiming total victory over the US SEC after years of court battles.On April 21, the SEC said that it would not amend and refile its fraud case against the former child actor and crypto evangelist. A court had dismissed the SEC’s fraud charges against Heart on Feb. 28.Heart announced on X that HEX had obtained a victory very few crypto projects could boast: “Richard Heart, PulseChain, PulseX, and HEX have defeated the SEC completely and have achieved regulatory clarity that nearly no other coins have.”HEX may be out of hot water with American securities regulators (for now), but Heart still faces charges in Europe, where he is wanted both for alleged tax fraud and for alleged assault on a minor. Richard Heart, real name Richard James Schueler, is still on Interpol’s wanted list. Source: InterpolSEC claimed Heart used HEX to defraud investorsIn July 2023, the SEC filed a complaint against Heart, whose real name is Richard James Schueler, along with HEX, HEX’s layer-1 blockchain project, PulseChain, and the decentralized exchange (DEX) for the PulseChain network, PulseX. The SEC made a number of allegations, including securities fraud and securities registration violations. It asked the court to bar Heart and his projects from participating in any sort of crypto asset security offering and to give up “all ill-gotten gains received as a result of the violations alleged.”The complaint noted Heart’s repeated claims that HEX could offer incredible rewards to make investors rich. It also wrote that Heart spent over $12 million of proceeds from HEX offerings on luxury goods such as watches, sports cars and a 555-carat diamond ring.Indeed, Heart is no stranger to the finer things in life. His celebrity is in part due to his frequent displays of wealth. In one video on X, he flaunted Louis Vuitton cases filled with dozens of luxury watches that he said were worth 9 million euros. Richard Heart wears four Rolex watches. Source: Luxury BazaarHeart’s court case came down to jurisdiction. Last year, his legal team filed a motion to dismiss the case on the grounds that the SEC failed to show that any activities had occurred within the United States. The SEC protested the motion. Ultimately, US District Judge Carol Bagley Amon agreed with Heart (the HEX founder does not live in the US), and she ruled that the statements regarding HEX’s price were targeted to a global audience — not US investors.“The alleged misappropriation occurred through digital wallets and crypto asset platforms, none of which were alleged to have any connection with the United States,” Amon stated.Finnish authorities want Heart on tax and assault chargesHeart claims that this legal victory provides new ground on which the crypto industry can thrive, creating a legal precedent that supposedly makes HEX safer to work with than any other crypto project.Heart and HEX may not face American securities regulators, but he is still in hot water with Finnish authorities over alleged tax evasion and assault.In September 2024, Finnish media wrote that Heart, who was reportedly residing in Helsinki, was remanded into custody in absentia. Finnish investigators, at the request of the country’s tax authorities, were investigating Heart and reportedly found that Heart’s income reporting did not match the tax service’s estimates.Helsinki police detective Harri Saaristol said, “Based on the very considerable amount of money in question and the long-term and planned nature of the activity, there are grounds to suspect gross tax evasion.”Related: Interpol issues ‘Red Notice’ for Hex founder Richard HeartIn the course of their investigation, Finnish police seized millions of euros worth of luxury watches from a residence in the city of Espoo near Helsinki. Europol also stated that Heart (referred to as Schueler in the report) is wanted for assaulting a minor. “Schueler physically assaulted a 16-year-old victim by grabbing their hair, dragging them into the stairwell and knocking them to the ground.”The allegations together have earned him a profile on Europol and Interpol’s most wanted criminal lists. Investigations are ongoing. How long can HEX keep it up?It seems Heart dodged US regulation because the SEC lacked jurisdiction rather than evidence. So, how long can he keep HEX going?Industry observers and analysts have long claimed that HEX was a new form of Ponzi scheme, namely due to the promises of a whopping 38% annual percentage yield, larger profits for onboarding new users and the fact that Heart owned some 90% of HEX tokens.Despite a number of committed acolytes on social media, the token seems all but dead. HEX’s price pumped briefly on news of the SEC dismissal. Zooming out, it’s barely moved since Heart’s legal troubles with the SEC began.At publishing time, HEX’s price is $0.002253; 24-hour transaction volumes barely top $250,000. HEX’s price spiked in 2021 before nearly falling off by early 2023. Source: CoinMarketCapMagazine: Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of Flame",
      "url": "https://cointelegraph.com/news/how-richard-heart-hex-beat-sec-fraud-charges?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745416233,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474847
    },
    {
      "headline": "Riot Platforms Secures $100M Bitcoin-Backed Credit Line From Coinbase",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/riot-platforms-secures-usd100m-bitcoin-backed-credit-line-from-coinbase",
      "source": "CoinDesk",
      "datetime": 1745415247,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/b5d61433a7938f2a44279c76d6a4b0aa0600e1eb-1920x1227.jpg?auto=format",
      "category": "crypto",
      "id": 7474837
    },
    {
      "headline": "CoinDesk 20 Performance Update: Index Gains 4.7% as All 20 Assets Trade Higher",
      "summary": "",
      "url": "https://www.coindesk.com/coindesk-indices/2025/04/23/coindesk-20-performance-update-index-gains-47-as-all-20-assets-trade-higher",
      "source": "CoinDesk",
      "datetime": 1745414477,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/cc512458507003232fb1733a56006238478fd4ea-480x360.jpg?auto=format",
      "category": "crypto",
      "id": 7474838
    },
    {
      "headline": "Ubisoft taps Immutable to launch Web3 card game ‘Might &amp; Magic: Fates’",
      "summary": "Gaming giant Ubisoft has partnered with Web3 firm Immutable to launch Might & Magic: Fates, a blockchain-powered strategy card game set in the Might & Magic universe.According to a press release shared with Cointelegraph, Might & Magic: Fates blends classic strategic gameplay with modern blockchain technology, offering players digital ownership through Immutable’s Web3 infrastructure.The game will launch on iOS and Android. The title introduces fresh mechanics, faction-based strategies, and a wide array of legendary heroes and creatures.Players will collect, trade, and customize decks using hundreds of cards, crafting unique strategies in a competitive environment where success is driven by skill and tactical decision-making.Immutable co-founder Robbie Ferguson teases major announcement. Source: Robbie Ferguson“The game is free-to-play with no hard progression barriers. Players advance by collecting cards and in-game currency through gameplay,” Justin Hulog, chief studio officer for Immutable, told Cointelegraph.“Additionally, those looking to speed up their progression or acquire specific cards can do so through marketplaces,” Hulog said.He added that players will have the ability to trade the digital collectible cards they own using dedicated platforms.Related: SEC closes investigation into Immutable nearly 5 months after Wells noticeImmutable to provide blockchain backboneImmutable, a leading Web3 gaming platform, will provide the blockchain backbone for the project.The firm is known for hosting titles like Gods Unchained and Guild of Guardians, both designed to give players true ownership of in-game assets through blockchain technology.Gods Unchained is a free-to-play NFT trading card game where players collect, trade, and battle using unique, player-owned cards. It runs on Immutable’s gas-free layer-2 solution and is transitioning to Immutable zkEVM for enhanced functionality.The card anatomy of Gods Unchained. Source: Gods UnchainedGuild of Guardians is a mobile RPG where players assemble NFT-based teams of heroes to battle in dungeon raids.Ubisoft has been among the few video game publishers to incorporate crypto elements into its games.Related: How Web3 can change gaming without changing how gamers playIn October 2024, the firm announced the release of its first game incorporating Web3 technology. Dubbed Champions Tactics: Grimoria, the game was deployed on the Oasys layer-2 Home Verse, a blockchain-powered ecosystem for Web3 gaming.Later in December 2024, Ubisoft and the Arbitrum Foundation announced the launch of Captain Laserhawk: The G.A.M.E., a Web3-enabled top-down shooter. The game is set in the Ubisoft gaming universe and features a cast of characters from titles including Far Cry: Blood Dragon, Rayman, Assassin’s Creed, Beyond Good and Evil, The Crew, Rainbow Six, Splinter Cell and Watch Dogs.Magazine: XRP win leaves Ripple and industry with no crypto legal precedent set",
      "url": "https://cointelegraph.com/news/ubisoft-immutable-launch-web3-card-game-might-and-magic-fates?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745414159,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474803
    },
    {
      "headline": "Strategy Stock Saw $180M in Failed Trades in March, Possible Short Squeeze Indicator",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/strategy-stock-saw-180m-in-failed-trades-in-march-possible-short-squeeze-indicator",
      "source": "CoinDesk",
      "datetime": 1745413910,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/12959ff7ebd2b686ec6ec4a46460734ac710ab18-6000x3376.jpg?auto=format",
      "category": "crypto",
      "id": 7474839
    },
    {
      "headline": "Pantera Leads $29M Funding for EigenLayer Rival Symbiotic to Expand Staking Play",
      "summary": "",
      "url": "https://www.coindesk.com/tech/2025/04/23/pantera-leads-usd29m-funding-for-eigenlayer-rival-symbiotic-to-expand-staking-play",
      "source": "CoinDesk",
      "datetime": 1745413200,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/941750747970721f6139909fbba8aed6a0fe9f44-5080x2878.jpg?auto=format",
      "category": "crypto",
      "id": 7474843
    },
    {
      "headline": "Travel Rule Compliance Surges on New Regs, Stablecoin Payments, Notabene Says",
      "summary": "",
      "url": "https://www.coindesk.com/business/2025/04/23/travel-rule-compliance-surges-on-new-regs-stablecoin-payments-notabene-says",
      "source": "CoinDesk",
      "datetime": 1745413200,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/8d37a1fab90b3c18790020cedd4a1c420ba630eb-2500x1667.jpg?auto=format",
      "category": "crypto",
      "id": 7474842
    },
    {
      "headline": "Scroll’s Euclid Upgrade Pushes It Into ‘Stage 1’ Decentralization Era",
      "summary": "",
      "url": "https://www.coindesk.com/tech/2025/04/23/scrolls-euclid-upgrade-pushes-it-into-stage-1-decentralization-era",
      "source": "CoinDesk",
      "datetime": 1745413200,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/90e63d0c32a106a77ade466d062ad2e7f6f72ef8-1898x1068.jpg?auto=format",
      "category": "crypto",
      "id": 7474841
    },
    {
      "headline": "Crypto Fundraising Is Positive, But Slower Than Expected Under Trump Administration",
      "summary": "",
      "url": "https://www.coindesk.com/policy/2025/04/23/crypto-fundraising-positive-but-slower-than-anticipated-under-trump-administration",
      "source": "CoinDesk",
      "datetime": 1745413200,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/4ed28251b899d726320d4ec1ffd034f267698c96-1796x1010.jpg?auto=format",
      "category": "crypto",
      "id": 7474840
    },
    {
      "headline": "Symbiotic raises $29M for staking-based universal coordination layer",
      "summary": "Cryptocurrency staking protocol Symbiotic closed a $29 million Series A funding round led by Web3-focused investment firms, including Pantera Capital and Coinbase Ventures, to support the launch of a new economic coordination layer for blockchain security.The round included more than 100 angel investors, with participation from major industry players including Aave, Polygon and StarkWare, the company said in an April 23 announcement shared with Cointelegraph.The closing of the funding round also marks the launch of Symbiotic’s Universal Staking Framework, which aims to be an economic coordination layer that bolsters blockchain security via staking.The new staking layer enables the use of any combination of cryptocurrencies to secure networks, including monolithic and modular layer-1 and layer-2 blockchains, the announcement stated.“We’ve created a modular framework that lets protocols evolve security models over time while efficiently coordinating risk,” Misha Putiatin, co-founder of Symbiotic, told Cointelegraph. “This empowers protocols at every stage of their lifecycle to evolve their security models seamlessly without rebuilding infrastructure.”Related: Ethereum L2 development is ‘double-edged sword’ for ETH valueThe “next step” in blockchain infrastructureThe new staking layer is the “next step in blockchain infrastructure” due to unlocking “economic coordination between assets and networks that were previously impossible,” according to Paul Veradittakit, managing partner at Pantera Capital.“As the number and variety of onchain assets continue to increase, Symbiotic allows them to easily serve as economic security while enabling entirely new use cases across DeFi,” he added.Blockchain networks looking to bolster security can adopt Symbiotic’s network of decentralized validators that bring “programmable security” without the need to modify infrastructure.According to the company, 14 networks, including Hyperlane, Spark and Avail, have already adopted the new coordination layer, with 20 more expected to follow.The staking layer enables “any protocol, including L1s, bridges, oracles, and even emerging verticals like artificial intelligence or zero-knowledge systems, to configure their own validator sets, incentive mechanisms and slashing conditions without having to rebuild core infrastructure,” Putiatin said.Related: Bitcoin ETFs log $912M inflows in ‘dramatic’ investor sentiment boostCrypto needs more collaborative economic incentives: HoskinsonCardano founder Charles Hoskinson, speaking at Paris Blockchain Week 2025, emphasized the need for collaborative economics in the crypto industry to counter growing competition from traditional tech firms entering the blockchain space.Charles Hoskinson. Source: CointelegraphCrypto’s “circular economy,” which often means that the rally of a specific cryptocurrency is bolstered by funds exiting another token, is limiting the growth of the industry, said Hoskinson.“The problem right now, with the way we’ve done things in the cryptocurrency space, is the tokenomics and the market structure are intrinsically adversarial. It’s sum 0,” said Hoskinson. “Instead of picking a fight, what you have to do is you have to find tokenomics and market structure that allows you to be in a cooperative equilibrium.”“You can’t build a global ecosystem this way, and you can’t win this way,” he said. “Because here’s the thing. The incumbents are much larger.”Magazine: 3 reasons Ethereum could turn a corner: Kain Warwick, X Hall of Flame",
      "url": "https://cointelegraph.com/news/symbiotic-29m-staking-universal-coordination-layer?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745413200,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474804
    },
    {
      "headline": "Coinbase to Benefit From Increased Institutional Crypto Adoption: Benchmark",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/coinbase-to-benefit-from-increased-institutional-crypto-adoption-benchmark",
      "source": "CoinDesk",
      "datetime": 1745411254,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/868ae20c7c05b3aab1825f55f45b74a9484fd851-1920x1280.jpg?auto=format",
      "category": "crypto",
      "id": 7474844
    },
    {
      "headline": "PayPal to Pay 3.7% Annual Yield on Stablecoin PYUSD to Encourage Broader Use",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/paypal-to-pay-3-7-annual-yield-on-stablecoin-pyusd-to-encourage-broader-use",
      "source": "CoinDesk",
      "datetime": 1745410711,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/ca66c441f504e730e61f0eb01b6d3a16206523c5-1920x1172.jpg?auto=format",
      "category": "crypto",
      "id": 7474845
    },
    {
      "headline": "New SEC chair ‘will be good for Bitcoin’ — Michael Saylor",
      "summary": "Michael Saylor, the CEO of top corporate Bitcoin holder Strategy (formerly MicroStrategy), expressed support for newly appointed US Securities and Exchange Commission (SEC) Chair Paul Atkins.In an April 23 X post, Saylor wrote that “SEC Chairman Paul Atkins will be good for Bitcoin.” The statement follows Atkins’ swearing-in as the 34th chairman of the SEC on April 21.Source: Michael SaylorBlue Macellari, the head of digital assets at investment firm T. Rowe Price, also commented positively on Atkins’ swearing in during a recent Bloomberg interview. She seemed hopeful and recognized a change in how the SEC has acted under the new administration, particularly with crypto-related information, including “close to six or seven roundtables” with industry professionals. She said:“I think that that’s gonna feed into the ability to make thoughtful and considerate policies.”Vincent Liu , chief investment officer at crypto investment firm Kronos Research, told Cointelegraph that “under Chair Atkins, finalizing custody rules for digital assets is expected to provide the investor protections that institutions demand.” Other issues expected to be resolved are clarification on whether some digital assets are securities or commodities:“Together, these two moves will help establish clear custody standards and bring much-needed clarity paving the way for the next wave of crypto product innovation.”Related: SEC and feds charge man over $200M crypto trading schemeWho is Atkins, and what does he mean for crypto?Accolades from representatives of the crypto industry readily followed Atkins’ appointment by US President Trump in late 2024. Bitwise Asset Management general counsel Katherine Dowling said at the time that he is a “great choice,” and Ripple Labs CEO Brad Garlinghouse said that he “will bring common sense back to the agency.”Not everyone was happy with the choice. Massachusetts Senator Elizabeth Warren said during Atkins’s nomination hearing that he had had “staggeringly bad judgment” in his role as a SEC commissioner leading up to the 2008 financial crisis. Atkins served at the agency from 2002 to 2008.She also raised an issue with his consulting firm, Patomak Global Partners, which had advised the crypto exchange FTX before its 2022 collapse. Warren said:“Your clients pay you north of $1,200 an hour for advice on how to influence regulators like the SEC, and if you’re confirmed, you will be in a prime spot to deliver for all those clients who’ve been paying you millions of dollars for years.”Liu said that “to maintain public trust and avoid even the perception of regulatory conflict of interest, it’s essential to implement clear guardrails.” Such a guardrail would include mandatory disclosures of prior industry ties, ethics oversight, and transparent public comment periods for all crypto rules.Related: SEC says it won’t re-file fraud case against Hex’s Richard HeartAtkins accused of biasWarren also sent a letter to Atkins in late March, stating that he should expect questions about his potential role at the agency due to his ties to the crypto industry through Patomak. Before being appointed, Atkins revealed a personal and family financial portfolio worth more than $327 million, according to a public ethics filing released ahead of his Senate confirmation hearing. Similarly, Trump’s artificial intelligence and crypto czar, David Sacks, filed a notice in early March suggesting that his venture capital firm sold more than $200 million in crypto and related stocks ahead of assuming his role.Magazine: Your AI ‘digital twin’ can take meetings and comfort your loved ones",
      "url": "https://cointelegraph.com/news/new-sec-chairm-will-be-good-for-bitcoin-strategy-s-michael-saylor?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745410699,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474770
    },
    {
      "headline": "Coinbase to hire 130+ staff as it expands into Charlotte’s fintech hub",
      "summary": "Crypto exchange giant Coinbase is set to expand its footprint by hiring over 130 employees in Charlotte, North Carolina, as part of a broader push to tap into emerging fintech talent pools across the US, a company spokesperson confirmed to Cointelegraph.“Coinbase is making a new investment in Charlotte with a new physical office and an immediate commitment to hire for 130+ local roles across both Compliance and Customer Support over the next six months,” the spokesperson said.They added that Coinbase’s focus on Charlotte is in response to the city’s emergence as a key financial and tech center, making it a prime choice for expansion to address increasing customer and compliance demands.With a fast-growing population and a highly skilled talent pool, Charlotte offers an ideal setting to support Coinbase’s long-term growth, the spokesperson said.Related: Coinbase Derivatives lists XRP futuresCoinbase remains a remote-first companyCoinbase has operated as a remote-first company since 2020, with existing offices in San Francisco and New York.“We are still a remote-first company; however, we have some roles globally that are in office due to the nature of the role and our focus on how we can best deliver for our customers,” the spokesperson said.They added that around 95% of Coinbase’s employees have the option to work from home, an office, or a mix. The bigger picture here is we’re making an intentional push to meet top talent where they are.Related: Paul Atkins’ loosely linked RSR token rises 13% after Coinbase listingThe move comes as Coinbase CEO Brian Armstrong outlined plans to add about 1,000 new US employees this year, driven by favorable regulatory signals from President Donald Trump’s pro-crypto administration.“Coinbase is planning to hire about 1,000 people in the United States this year as a direct result of his actions already in the first 60 days or so,” Armstrong said in a video posted to X on March 7.Armstrong revealing hiring intentions outside the White House. Source: Brian ArmstrongAdding 1,000 more employees would increase Coinbase’s total workforce by about 27%, according to Stockanalysis’ most recent data, which shows that the crypto exchange currently has 3,772 employees.The new expansion plans also come as Coinbase has confirmed that it is considering applying for a US federal bank charter.Magazine: Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of Flame",
      "url": "https://cointelegraph.com/news/coinbase-expands-charlotte-hiring-130-employees-fintech-growth?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745409072,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474771
    },
    {
      "headline": "Crypto Daybook Americas: Bitcoin Bulls Play 'Heads I Win, Tails Bears Lose’ as BTC Tops $94K",
      "summary": "",
      "url": "https://www.coindesk.com/daybook-us/2025/04/23/crypto-daybook-americas-bitcoin-bulls-play-heads-i-win-tails-bears-lose-as-btc-tops-usd94k",
      "source": "CoinDesk",
      "datetime": 1745406900,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/48a6143d6c17b7ac62718798516eb7294714bbab-2400x1600.jpg?auto=format",
      "category": "crypto",
      "id": 7474769
    },
    {
      "headline": "Bitcoin enters world&#039;s top 5 largest assets, surpassing Google, Silver, Amazon",
      "summary": "Bitcoin (BTC) has overtaken Alphabet (Google) to become the world’s fifth most valuable asset by market capitalization.As of April 23, Bitcoin’s market cap surged to $1.87 trillion, edging past Alphabet’s $1.859 trillion valuation, according to asset ranking data. BTC is now behind only gold, Apple, Microsoft and Nvidia.Top assets by market cap. Source: CompaniesMarketCap.comBitcoin beats Nasdaq 100 returns in AprilBitcoin’s edge over Alphabet coincides with its ongoing “decoupling” from its long-standing correlation with US tech stocks, especially in April, when BTC’s price rallied 15% despite the Nasdaq 100’s returns of 4.50% in the same period.BTC/USD and Nasdaq 100 price comparison chart. Source: TradingViewThis decoupling followed months of disappointment for crypto bulls, who expected a stronger post-election rally.Even with April’s gains, BTC’s price remains 16% below its $109,000 all-time high set in January, when Trump was re-inaugurated as the US president.Source: Geiger CapitalTrump’s recent criticism of Federal Reserve Chair Jerome Powell and his executive order to create a Strategic Bitcoin Reserve (SBR) — which is nearing its 60-day review window — is helping reignite investor interest in crypto.Related: Bitcoin could hit $1M if US buys 1M BTC — Bitcoin Policy Institute“Chatter questioning Fed independence is having positive spillover effects on BTC,” said Vetle Lunde, head of research at K33.Macro analyst Fejau stressed that capital outflows from US assets will likely benefit Bitcoin, given countries can’t tariff it — and that it “provides high beta to a portfolio without the current tail risks associated with US tech.”“This market regime is what Bitcoin was built for,” he wrote, adding:“One the degrossing dust settles, it will be the fastest horse out of the gate.Bitcoin market worth more than two TeslasAlphabet is facing headwinds in the form of regulatory crackdowns, antitrust challenges and a slowdown in digital ad revenue. The rise of AI-focused rivals and reduced growth projections have also dented confidence in Google’s long-term dominance.Source: The Japan TimesTo put Bitcoin’s $1.87 trillion valuation into perspective, it’s now worth more than two Tesla companies.The EV giant famously added Bitcoin to its balance sheet in early 2021, when it was trading for around $33,500. It is now sitting on around 180% gains worth over $1 billion.This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.",
      "url": "https://cointelegraph.com/news/bitcoin-now-the-worlds-5th-largest-asset-surpassing-google?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745406769,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474772
    },
    {
      "headline": "$635M liquidated in 24H as trader predicts $100K Bitcoin short squeeze",
      "summary": "Crypto markets have faced a wave of liquidations over the past 24 hours, with total losses reaching $635.9 million, according to market data. Most of the liquidations (over $560 million) came from short positions, signaling growing pressure on bearish traders.Bitcoin (BTC) led the liquidation charts, with $293 million in short positions wiped out as BTC surged past $94,000, marking a 6.29% gain within one day, according to CoinGlass data.Ether (ETH) followed, with over $109 million in short liquidations as its price climbed nearly 10% to $1,787.Data from exchanges showed Binance accounted for the largest share of liquidations at $18.7 million in the last four hours, with 78% of that targeting short positions. Bybit and OKX also saw significant liquidation volumes, reflecting widespread volatility across major platforms.Crypto market sees a wave of liquidations. Source: CoinGlassRelated: Bitcoin breaks downtrend with spike toward $92.6K, but who’s behind the price momentum?Trader says Bitcoin liquidity building around $100,000 levelAmid the market turbulence, crypto analyst Mister Crypto noted that liquidity is “piling up around $100,000” for Bitcoin.In a recent post on X, he warned that bears are showing signs of desperation, suggesting a potential short squeeze could drive BTC closer to the six-figure mark.A short squeeze occurs when a rapid price increase forces traders betting against the market to cover their positions, fueling further upward momentum.Mister Crypto also shared a Binance BTC/USDT Liquidation Heatmap, showing that a large amount of Bitcoin trading activity and liquidation orders are building up around the $100,000 level, meaning many traders have set positions that could be triggered if the price reaches that point.Source: Mister CryptoBitcoin surged to a 45-day high above $94,000 on April 23. The leading cryptocurrency was trading at $94,236, up by more than 6% over the past day, at the time of writing, according to data from CoinMarketCap.Related: Bitcoin price prepares for ‘70% to 80%’ gain as onchain metrics and spot BTC ETF inflows spikeNot everyone believes Bitcoin will hit $100,000 soonHowever, not everyone is optimistic about an imminent Bitcoin surge to $100,000.“Bitcoin’s climb to $94K reflects renewed global optimism, but its path to $100K remains uncertain,” Vincent Liu, chief investment officer at Kronos Research, told Cointelegraph.He said the outcome of the May 6 Federal Open Market Committee (FOMC) meeting, ongoing trade negotiations with India and China, and broader macro conditions will be critical. He added:“Cleared tariffs and potential Fed rate cuts could ignite further momentum, while rate hikes or unresolved tensions may keep BTC range-bound. US monetary policy will be pivotal in determining if Bitcoin reaches this milestone.”Magazine: XRP win leaves Ripple and industry with no crypto legal precedent set",
      "url": "https://cointelegraph.com/news/bitcoin-short-squeeze-predicted-as-635m-liquidated-bulls-eye-100k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745404219,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474730
    },
    {
      "headline": "Bitcoin ETFs log $912M inflows in ‘dramatic’ investor sentiment boost",
      "summary": "Investments in Bitcoin exchange-traded funds (ETFs) have rebounded to levels last seen in January, signaling a recovery in investor sentiment from concerns around global trade tariff escalations.US spot Bitcoin (BTC) ETFs had over $912 million worth of cumulative net inflows on April 22, marking their highest daily investment in more than three months since Jan. 21, Farside Investors data shows.Bitcoin ETF Flow, millions. Source: Farside Investors“Bitcoin ETPs just saw the largest daily inflows since 21st January in a dramatic improvement in sentiment,” according to James Butterfill, head of research at CoinShares.Related: Bitcoin still on track for $1.8M in 2035, says analystInvestor sentiment appeared to improve after US President Donald Trump said that import tariffs on Chinese goods will “come down substantially,” adopting a softer tone in negotiations.The de-escalation and growing ETF inflows pushed Bitcoin price above $93,000 for the first time in seven weeks, Cointelegraph reported on April 23.The growing institutional investment and presence of ETFs may also accelerate the historic four-year cycle and bolster BTC to new highs before the end of 2025, analysts told Cointelegraph.US dollar weakness may reinforce Bitcoin’s safe-haven appealThe US dollar’s weakness may also contribute to the growing investor demand for Bitcoin. DXY, year-to-date chart. Source: Cointelegraph/TradingView The US Dollar Index (DXY), which measures the strength of the greenback against a basket of leading fiat currencies, fell nearly 9% since the beginning of 2025, to an over three-year low of 98.8 last seen in April 2022, TradingView data shows.“Macro factors like a weakening dollar and rising gold correlation,” may reinforce Bitcoin’s appeal as a hedge against economic volatility, Ryan Lee, chief analyst at Bitget Research, told Cointelegraph.Related: Crypto, stocks enter ‘new phase of trade war’ as US-China tensions riseBitcoin no longer trading in the “shadow of tech”Crypto and traditional stock markets are “walking a tightrope between political drama and economic reality,” with Bitcoin staging a significant rebound thanks to “strong ETF inflows, institutional acquisitions, and a weakening US dollar,” according to Nexo dispatch analyst Iliya Kalchev:“Bitcoin’s strength amid dollar weakness, record gold prices, and renewed institutional buying reflects a market recalibrating what safety looks like.”“The conversation has clearly shifted. Bitcoin is no longer trading in the shadows of tech — it’s becoming a lens through which macro uncertainty is priced,” he added.Nansen CEO Alex Svanevik also praised Bitcoin’s resilience, noting that the maturing asset is becoming “less Nasdaq — more gold” over the past two weeks, increasingly acting as a safe haven asset against economic turmoil, but concerns over economic recession may limit its price trajectory.On April 21, BitMEX co-founder Arthur Hayes predicted that this might be the “last chance” to buy Bitcoin below $100,000, as the incoming US Treasury buybacks may signal the next significant catalyst for Bitcoin price.Magazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8Investments in Bitcoin exchange-traded funds (ETFs) have resurged to January’s levels, signaling a significant recovery in investor sentiment from the concerns related to global trade tariff escalations.The US spot Bitcoin (BTC) ETFs received over $912 million worth of cumulative net inflows on April 22, marking the highest daily investment in over three months since Jan. 21, Farside Investors data shows.Bitcoin ETF Flow, millions, Farside Investors“Bitcoin ETPs just saw the largest daily inflows since 21st January in a dramatic improvement in sentiment,” wrote James Butterfill, head of research at CoinShares, in an April 23 X post.Related: Bitcoin still on track for $1.8M in 2035, says analystInvestor sentiment was significantly improved after US President Donald Trump said that import tariffs on Chinese goods will “come down substantially,” showcasing a softer tone in negotiations.The notable de-escalation and the growing ETF inflows pushed Bitcoin price above $93,000 for the first time in seven weeks, Cointelegraph reported on April 23.The growing institutional investment and presence of ETFs may accelerate the historic four-year cycle and bolster Bitcoin to new highs before the end of 2025, analysts told Cointelegraph.Related: Crypto, stocks enter ‘new phase of trade war’ as US-China tensions riseBitcoin no longer trading in the “shadow of tech”Crypto and traditional stock markets are “walking a tightrope between political drama and economic reality,” with Bitcoin staging a significant rebound thanks to “strong ETF inflows, institutional acquisitions, and a weakening USD,” according to Nexo dispatch analyst Iliya Kalchev.The analyst told Cointelegraph, adding:“Bitcoin’s strength amid dollar weakness, record gold prices, and renewed institutional buying reflects a market recalibrating what safety looks like.”“The conversation has clearly shifted. Bitcoin is no longer trading in the shadows of tech — it’s becoming a lens through which macro uncertainty is priced,” the analyst added.Nansen CEO Alex Svanevik also praised Bitcoin’s resilience, noting that the maturing asset is becoming “less Nasdaq — more gold” over the past two weeks, increasingly acting as a safe haven asset against economic turmoil, but concerns over economic recession may limit its price trajectory.On April 21, BitMEX co-founder Arthur Hayes predicted that this might be the “last chance” to buy Bitcoin below $100,000, as the incoming US Treasury buybacks may signal the next significant catalyst for Bitcoin price.Magazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8",
      "url": "https://cointelegraph.com/news/bitcoin-etfs-912m-dramatic-sentiment-boost?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745402077,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474719
    },
    {
      "headline": "Crypto drainers now sold as easy-to-use malware at IT industry fairs",
      "summary": "Crypto drainers, malware designed to steal cryptocurrency, have become easier to access as the ecosystem evolves into a software-as-a-service (SaaS) business model.In an April 22 report, crypto forensics and compliance firm AMLBot revealed that many drainer operations have transitioned to a SaaS model known as drainer-as-a-service (DaaS). The report revealed that malware spreaders can rent a drainer for as little as 100 to 300 USDt (USDT).Crypto drainers report image. Source: AMLBotAMLBot CEO Slava Demchuk told Cointelegraph that “previously, entering the world of cryptocurrency scams required a fair amount of technical knowledge.” That is no longer the case. Under the DaaS model, “getting started isn’t significantly more difficult than with other types of cybercrime.”Demchuk explained that would-be drainer users join online communities to learn from experienced scammers who provide guides and tutorials. This is how many criminals involved with traditional phishing campaigns transition to the crypto drainer space.Related: North Korean hackers target crypto devs with fake recruitment testsCybercrime in Russia — almost legalGroups offering crypto drainers as a service are increasingly bold and some are evolving almost like traditional business models, Demchuk said, adding:“Interestingly, some drainer groups have become so bold and professionalized that they even set up booths at industry conferences — CryptoGrab being one such example.“When asked how a criminal operation can send representatives to information technology industry events without repercussions, such as arrests, he pointed to Russian cybercrime enforcement as the reason. “This can all be done in jurisdictions like Russia, where hacking is now essentially legalized if you're not operating across the post-Soviet space,” he said.The practice has been an open secret in the cybersecurity industry for many years. Cybersecurity news publication KrebsOnSecurity reported in 2021 that “virtually all ransomware strains” deactivate without causing harm if they detect Russian virtual keyboards installed.Similarly, the information stealer Typhon Reborn v2 checks the user’s IP geolocation against a list of post-Soviet countries. According to networking firm Cisco, if it determines that it is located in one of those countries, it deactivates. The reason is simple: Russian authorities have shown that they will act if local hackers hit citizens of the post-Soviet bloc.Related: What is Bitcoinlib, and how did hackers target it?Drainers keep growingDemchuk further explained that DaaS organizations usually find their clientele within existing phishing communities. This includes gray and black hat forums on both clearnet (regular internet) and darknet (deep web), as well as Telegram groups and channels and gray market platforms.In 2024, Scam Sniffer reported that drainers were responsible for about $494 million in losses, a 67% increase over the previous year, despite a 3.7% increase in the number of victims. Drainers are on the increase, with cybersecurity giant Kaspersky reporting that the number of online resources dedicated to them on darknet forums rose from 55 in 2022 to 129 in 2024.Developers are often recruited through normal job adverts. AMLBot’s open-source intelligence investigator, who prefers to remain anonymous for safety reasons, told Cointelegraph that while researching drainers, his team “did come across several job postings specifically targeting developers to build drainers for Web3 ecosystems.”He provided one job advert that described the required features of a script that would empty Hedera (HBAR) wallets. Once again, the offer was mainly targeted at Russian speakers:“This request was originally written in Russian and shared in a developer-focused Telegram chat. It’s a clear example of how technical talent is actively recruited in niche, often semi-open communities.“The investigator further added that ads like this appear in Telegram chats for smart-contract developers. Those chats are not private or restricted, but they are small, with usually 100 to 200 members.Administrators quickly deleted the announcement provided as an example. Still, “as is often the case, those who needed to see it had already taken note and responded.”Traditionally, this kind of business was conducted on specialized clearnet forums and deep web forums accessible through the Tor network. Still, the investigator said that much of the content moved to Telegram thanks to its policy against sharing data with authorities. This changed following the arrest of Telegram CEO Pavel Durov:“As soon as Telegram announced that it was giving out data, then the outflow to Tor started again, because it is easier to protect oneself there.”Still, this is a concern to cybercriminals that may no longer be relevant. Earlier this week, Durov expressed misgivings over a growing threat to private messaging in France and other European Union countries, warning that Telegram would rather exit certain markets than implement encryption backdoors that undermine user privacy.Magazine: As Ethereum phishing gets harder, drainers move to TON and Bitcoin",
      "url": "https://cointelegraph.com/news/crypto-drainers-sold-as-malware-at-it-conferences?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745401514,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474720
    },
    {
      "headline": "Bitcoin exchange buying is back as &#039;Spoofy the Whale&#039; lifts $90K asks",
      "summary": "Key points:Whales on Binance joins Coinbase in adding BTC exposure as Bitcoin recovers above $90,000.The Coinbase premium is back in the green amid a broad risk-asset relief rally.Resistance attributed to an entity dubbed “Spoofy the Whale” at $90,000 disappears.Bitcoin (BTC) has fresh whale buying pressure across major exchanges as large-volume investors boost BTC price gains.New data from onchain analytics platform CryptoQuant reports both Binance and Coinbase whales “pushing the market up.”Coinbase BTC premium hits highest since FebruaryBitcoin whales are wasting no time adding BTC exposure as BTC/USD hits its highest levels in over six weeks.This is reflected in market data, including the so-called Coinbase premium — the difference in pricing between the BTC/USD pair on the largest US exchange, Coinbase, and Binance's BTC/USDT equivalent.A positive premium indicates US buyer interest, with current values showing “alternate” demand between Coinbase and Binance.“These two exchanges, which can be considered the largest in the world, have their whales alternately pushing the market up, creating a very positive situation, CryptoQuant contributor Crypto Dan summarized in one of its “Quicktake” blog posts.Coinbase premium index. Source: CryptoQuantCrypto Dan added that retail investors had undergone a shakeout thanks to the recent unpredictable BTC price action.“Recently, most people had shifted their view to a bearish cycle, and public interest had significantly decreased,” he wrote. “Furthermore, with Bitcoin and altcoins in an oversold condition, the market has effectively shaken off the retail investors (the ‘small fish’), which means the market is now ready for a rise.”Mystery whale “relinquished control” of Binance order bookBinance order book data appears to corroborate the theory.Related: US dollar goes 'no-bid' — 5 things to know in Bitcoin this weekAs highlighted by Keith Alan, co-founder of trading resource Material Indicators, all classes of whales on Binance have begun buying.In addition, a wall of resistance at $90,000, which Allen previously attributed to an entity he dubbed “Spoofy the Whale,” has vanished.“Spoofy the Whale has relinquished control of the BTC order book on Binance,” he summarized in an X post on April 23.BTC/USDT order book liquidity. Source: Keith AlanXAlan reiterated that Bitcoin still needed a decisive reclaim of its yearly open at around $93,500 to complete a bullish turnaround and leave its multimonth downtrend behind.This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.",
      "url": "https://cointelegraph.com/news/bitcoin-exchange-buying-is-back-spoofy-the-whale-lifts-90k-asks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745401207,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474714
    },
    {
      "headline": "Binance tightens South African compliance rules for crypto transfers",
      "summary": "Binance is set to implement new compliance measures for South African users, requiring sender and receiver information for all crypto deposits and withdrawals.In an official announcement on April 23, the largest cryptocurrency exchange in terms of daily trading volume of cryptocurrencies said the move comes in response to local regulatory demands.Starting April 30, 2025, Binance users in South Africa will be prompted to provide additional information when transferring crypto.For deposits, users must disclose the sender’s full name, country of residence, and, if applicable, the name of the originating crypto exchange. Similarly, withdrawals will require beneficiary details before processing.Binance to require information for all crypto transfers in South Africa. Source: BinanceThe update will only impact crypto deposits and withdrawals, leaving trading and other platform features unaffected.Related: US judge transfers Binance lawsuit to Florida, citing first-to-file ruleMissing transfer details may reverse transactionsBinance warned that failure to provide the required information could result in delayed transactions or, in some cases, a return of funds to the sender.In preparation for the rollout, users will need to re-login to their accounts starting April 24.The change comes as South Africa moves to boost oversight of the rapidly moving crypto sector.On April 2, Bloomberg reported that South Africa’s Revenue Service (SARS) is urging individuals, crypto exchanges and intermediaries involved in crypto transactions to register with the authority, warning that failure to do so is now illegal.In March, the Financial Sector Conduct Authority (FSCA) of South Africa issued a public warning against two unlicensed crypto firms, Afriinvest and Mutualwealth, accusing them of soliciting investments while promising unrealistic returns of up to 10,000 rand ($542) per day.Related: Binance, KuCoin, MEXC report service issues due to AWS network interruptionSouth Africa pushes to become key crypto hubEmerging economies across Africa, particularly South Africa, are positioning themselves as potential digital asset hubs amid growing regulatory clarity, Ben Caselin, chief marketing officer (CMO) of Johannesburg-based crypto exchange VALR, told Cointelegraph in September 2024.Caselin claimed that South Africa’s strong legal framework and ease of business make it a key entry point for crypto expansion across the continent.The South African crypto market is projected to generate $278 million in revenue in 2025, with expectations to grow at a compound annual growth rate (CAGR) of 7.86% and reach $332.9 million by 2028, according to Statista.Revenue in South Africa’s crypto market is expected to grow by 7.86% by 2028. Source: StatistaRegulatory momentum is increasing, with the FSCA approving 59 crypto platform licenses in March 2024, while over 260 applications remain under review.Cointelegraph contacted Binance for comments but did not receive a response by publication.Magazine: Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of Flame",
      "url": "https://cointelegraph.com/news/binance-crypto-transfer-compliance-south-africa-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745398068,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474706
    },
    {
      "headline": "Bitcoin Futures Open Interest Surge Shows Investor Confidence on Trade Deals, Powell",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/bitcoin-futures-open-interest-surge-shows-investor-confidence-on-trade-deals-powell",
      "source": "CoinDesk",
      "datetime": 1745396946,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/001b677cc485afd9a51ec2c96db9af60f1fcfdfc-5806x3871.jpg?auto=format",
      "category": "crypto",
      "id": 7474708
    },
    {
      "headline": "Bitcoin Becomes Fifth Largest Global Asset, Surpasses Google's Market Cap",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/bitcoin-becomes-fifth-largest-global-asset-surpasses-google-s-market-cap",
      "source": "CoinDesk",
      "datetime": 1745396031,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/51367570137bef1f7160f798354c2c1a869aa2e4-1440x1080.jpg?auto=format",
      "category": "crypto",
      "id": 7474709
    },
    {
      "headline": "What are spot Solana ETFs with staking? Canada’s crypto innovation explained",
      "summary": "What are spot Solana ETFs and why are they important?              A spot Solana ETF is an exchange-traded fund that holds Solana (SOL) tokens directly, providing investors real-time exposure to the asset’s market price. Rather than using complex trading platforms or crypto wallets, you can access Solana via a regulated financial product traded on a traditional stock exchange. The value of Solana ETFs is directly tied to the open market price of SOL, offering a simple way to gain exposure to the blockchain’s performance without directly holding the asset. Unlike futures-based ETFs that use derivative contracts to speculate on Solana’s future prices, a spot ETF tracks the performance of the actual asset. This distinction is significant because futures products may face pricing inefficiencies, leading to performance mismatches over time. Spot ETFs are more transparent and directly reflect SOL's real-time supply and demand on the Solana blockchain.Spot Solana ETFs mark a significant step toward mainstream crypto adoption. These products enable retail and institutional investors to gain exposure to the Solana ecosystem while operating within the bounds of securities regulations.Like spot Bitcoin and Ethereum ETFs, spot Solana exchange-traded funds are expected to expand market access and serve as another entry point to decentralized finance (DeFi) for traditional investors.Did you know? Spot ETFs aim to mirror an asset’s current price by directly holding the asset, while futures ETFs use derivative contracts to speculate on future price movements.                  Launch of spot Solana ETFs on the Toronto Stock Exchange              On April 16, 2025, four spot Solana ETFs started trading on the Toronto Stock Exchange, following approval from the Ontario Securities Commission (OSC). With this, Canada became the first country to launch spot SOL ETFs with staking. The OSC granted approval to the spot Solana ETFs of four asset managers: 3iQ, Purpose, Evolve and CI Financial. Unlike products that only track Solana’s price, these funds hold SOL tokens, giving investors direct ownership of the asset. The funds are secured via institutional-grade cold storage custody. Each fund tracks a distinct Solana-related index, offering diverse strategies with onchain asset backing. Despite their structural differences, these ETFs are all designed for long-term investment, reflecting the issuers' strong belief in Solana's future in DeFi.By incorporating staking, these spot Solana ETFs provide an active way for investors to earn returns in the cryptocurrency market, all within a regulatory framework and secure, institutional-grade custody services.These ETFs enable staking through a partnership with TD Bank, allowing the SOL they hold to actively support and secure the Solana network. In return, the network issues staking rewards, which can be passed on to investors. Since Solana typically offers higher staking yields than Ethereum, this structure may translate into greater potential returns for investors.                  How does staking boost returns for  Solana ETF investors?              By offering staking, these spot Solana ETFs may boost returns for investors by an estimated 2%-3.5% annually, in addition to the performance of the underlying SOL. The ETFs generate yield by working with staking partners that delegate up to 50% of the fund’s assets for staking. Staking rewards generated by the ETF are typically shared between shareholders and the fund manager, with the specific allocation varying depending on the ETF issuer.Management fees of these spot Solana ETFs vary from 0.15% to 1%, with some providers offering fee waivers during the initial launch phase. After two days of trading, the combined assets under management for the four ETFs total about $73.5 million.Staking Solana may yield higher returns than staking Ether (ETH). The ETFs intend to pass these additional rewards on to investors, potentially reducing the long-term cost of owning the ETF.Here is a comparison between the various spot Solana ETFs with staking approved in Canada:Cathie Wood’s ARK Invest has incorporated staked Solana into its ARKW and ARKF ETFs, with both funds now holding shares of Canada’s 3iQ Solana Staking ETF (SOLQ).Did you know? Altcoin ETFs track the prices of one or more cryptocurrencies other than Bitcoin (BTC). They diversify investor exposure within the cryptocurrency market, as various altcoins exhibit different price behaviors and underlying strengths.                  How Canada’s spot Solana ETFs unlock passive income opportunities              Canada offering spot Solana ETFs with staking is an innovative step. Existing SOL investment products, such as the crypto ETFs in Europe and the futures-based ETFs in the US do not offer an opportunity to earn staking yield.Incorporating yield into a regulated crypto ETF structure addresses a long-standing demand from investors and asset managers interested in proof-of-stake (PoS) networks like Solana and Ethereum. As staking is central to these tokens’ value, its inclusion enables SOL ETFs to offer a passive income component, making them more appealing to traditional investors seeking income-generating opportunities. The OSC’s approval of the staking feature for spot Solana ETFs may boost SOL’s position. However, staking carries risks, such as potential losses from validator penalties (slashing) or network disruptions, which could affect returns.Nonetheless, this approval reinforces Canada’s pioneering role in crypto ETF innovation, having launched the world’s first spot Bitcoin and Ethereum ETFs in 2021, ahead of many other jurisdictions. By allowing staking rewards in spot Solana ETFs, Canadian regulators have signalled a growing acceptance of crypto-powered finance. Did you know? ETFs aren’t without risks. Market fluctuations can lead to losses, and tracking errors can cause an ETF'’s performance to differ from its benchmark index, affecting investor outcome.                  What Canada’s launch of Solana ETFs with staking means for pending SEC applications              Canada’s decision provides alternative cryptocurrency investment choices for its investors and may serve as an example for other countries considering spot ETFs for cryptocurrencies other than Bitcoin.Despite a subdued global macroeconomic climate — partly shaped by trade tensions during Donald Trump’s presidency — Canada’s regulators have taken a proactive stance, embracing innovation in the digital asset space. The greenlighting of Solana ETFs with staking reflects a maturing approach to crypto policy and signals confidence in alternative layer-1 networks.Meanwhile, in the United States, anticipation is building. The launch of Solana futures on the Chicago Mercantile Exchange (CME) on March 17, 2025, is seen as a stepping stone toward a US spot ETF. The SEC is currently reviewing 72 crypto-related ETF applications as of April 21, covering a spectrum of assets from major altcoins like XRP (XRP) to memecoins like Dogecoin (DOGE), including proposals for leveraged and derivative products.As of April 21, 2025, the SEC is reviewing 72 crypto-related ETF applications, including derivatives. The filings range from major cap altcoins to memecoins and include leveraged products and options. The outcome of Canada’s pioneering approach may offer valuable insights to regulators and could potentially influence the SEC’s decisions regarding these filings.However, the SEC’s stance may differ significantly from Canada’s due to structural and regulatory complexities within the US financial system. Unlike Canada's more unified regulatory framework, the US divides oversight between multiple agencies — including the SEC, CFTC, and state regulators — creating friction in crypto policymaking.Canada’s trailblazing move could nonetheless offer a valuable case study for US regulators. As markets await the SEC’s decisions, the key question remains whether Washington will follow Ottawa’s lead — or chart its own course and a slower timeline for non-Bitcoin spot ETFs.",
      "url": "https://cointelegraph.com/explained/what-are-spot-solana-etfs-with-staking-canadas-crypto-innovation-explained?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745395500,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474698
    },
    {
      "headline": "XRP Ledger Bug Patched After 'Serious' Flaw Spotted in XRPL Library",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/xrp-ledger-bug-patched-after-serious-flaw-spotted-in-xrpl-library",
      "source": "CoinDesk",
      "datetime": 1745395217,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/03e2d9be0c65442154bdff629a58c6496d145707-1280x717.jpg?auto=format",
      "category": "crypto",
      "id": 7474710
    },
    {
      "headline": "Cardano’s ADA, Ether Lead Market Gains as Bitcoin ‘Decoupling’ Continues",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/cardano-s-ada-ether-lead-market-gains-as-bitcoin-decoupling-continues",
      "source": "CoinDesk",
      "datetime": 1745393558,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/2d0faf177048412c8dcd3757409676b4c71f22b8-7952x5304.jpg?auto=format",
      "category": "crypto",
      "id": 7474711
    },
    {
      "headline": "SEC Walks Away From Case Against HEX Founder Richard Heart, Attorney Says",
      "summary": "",
      "url": "https://www.coindesk.com/policy/2025/04/23/sec-walks-away-from-case-against-hex-founder-richard-heart-attorney-says",
      "source": "CoinDesk",
      "datetime": 1745392612,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/03e37489ed1eae296cbd07f255ddf7baed72214e-2826x1554.png?auto=format",
      "category": "crypto",
      "id": 7474712
    },
    {
      "headline": "Bitcoin, Ether, Dogecoin Surge Spurs $500M in Short Liquidations",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/bitcoin-ether-dogecoin-surge-spurs-usd500m-in-short-liquidations",
      "source": "CoinDesk",
      "datetime": 1745388533,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/b84cc03a0757fa4a135a5267f8d8f07b962c3105-1280x720.jpg?auto=format",
      "category": "crypto",
      "id": 7474697
    },
    {
      "headline": "Ethereum bounces back as market dominance recovers from all-time low",
      "summary": "Ethereum’s price has surged after having been in the doldrums for weeks, helping boost its market share after it hit record lows.Ether (ETH) has surged almost 15% over the past 24 hours, topping $1,800 on April 23. It has outperformed Bitcoin, which notched a 6% gain, and the wider crypto market, which has climbed almost 5% to reclaim a total market value of $3 trillion. Ether has now managed to recover almost 30% since its April 9 crash to $1,400, leading some analysts to suggest that the worst may be over for the world’s second-largest crypto asset.“You can hate Ethereum all you want, but when it has a big day, the entire crypto ecosystem goes up,” crypto trader and analyst “Income Sharks” commented to their 640,000 X followers.Market analyst “Ash Crypto” said ETH was “about to explode,” drawing comparison from the current chart pattern for Ether to that for Bitcoin’s performance in late 2024. BTC vs ETH performance and prediction. Source: Ash Crypto Jeff Mei, chief operating officer at the crypto exchange BTSE, was not conviced Ethereum was moving idependently, and told Cointelegraph that Ether’s gain “was largely due to it tracking the price of Bitcoin and the overall market,” and that that Paul Atkins’ confirmation as chair of the US Securities and Exchange Commission had boosted overall market sentiment.Earlier this month, ETH had fallen back to bear market prices and had seen its market share dwindle amid a wide market downturn marred by fears of a trade war. On April 22, analyst “Rekt Capital” said that ETH’s market dominance has fallen back to all-time lows but “managed to protect 2019 all-time lows as support.” ETH dominance fell to its September 2019 low of 7% on April 22, according to TradingView. However, its subsequent price pump has seen that share bounce off this critical support level and return above 7.5% on April 23. ETH dominance lows. Source: Rekt CapitalFundamental catalysts supporting the move10x Research’s Markus Thielen told Cointelegraph that it hasn’t taken much to drive Ethereum higher, as a “heavily shorted market is now experiencing a squeeze.” Related: Ethereum Foundation shifts focus to user experience, layer-1 scaling Technically, Ethereum was oversold on both daily and weekly timeframes, setting the stage for a rebound, he said. “With the upcoming upgrade moving to mainnet, there’s also a fundamental catalyst supporting the move.” Magazine: Altcoin season to hit in Q2? Mantra’s plan to win trust: Hodler’s Digest",
      "url": "https://cointelegraph.com/news/eth-bounces-back-dominance-recovers-all-time-low?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745388149,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474684
    },
    {
      "headline": "Bitcoiners should be cautious over rally as stablecoin indicator lags: Analyst",
      "summary": "Bitcoin’s 12% rally over the week and a surge in related exchange-traded fund inflows have analysts thinking it could soon reach $100,000, but one crypto analyst has said to temper hopes as a key indicator is still giving mixed signals.“Given that our stablecoin minting indicator has yet to return to high-activity levels, we remain cautious about the sustainability of the current Bitcoin rally,” 10x Research head of research Markus Thielen said in an April 23 markets report.Stablecoin absence may limit Bitcoin upsideThielen explained that a measured move from the falling wedge pattern, which traders perceive as a potential bullish reversal signal, shows that Bitcoin (BTC) may reclaim $99,000.He added, however, that “the absence of strong stablecoin inflows raises questions about follow-through.”Markus Thielen is watching the stablecoin minting indicator before confirming the Bitcoin uptrend is sustainable. Source: 10x ResearchBitcoin was trading at $93,133 at the time of writing, up 11.42% over the past seven days, according to CoinMarketCap. Thielen told Cointelegraph that stablecoin inflows “tend to correlate strongly with stickier money, while an increase in futures leverage could simply mean that fast traders are taking advantage of a quick move higher.” Spot Bitcoin ETF inflows surge, a true “demand-led rally”It comes as spot Bitcoin ETFs in the US posted inflows of $912.7 million on April 22, the highest level since Jan. 17, according to Farside data.Swyftx lead analyst Pav Hundal told Cointelegraph that the inflows suggest “this is a true, demand-led rally. Not just a hot flash of excited futures traders moving price.”“If the news headlines finally quieten, we could break new highs sooner than everyone thinks. A fast track to $100,000 looks plausible, but things change quickly in a Trump presidency.”Thielen said if uncertainty continues to decline, “a further acceleration could provide the liquidity needed to support a more sustained rally.”Related: Bitcoin risks 10%-15% BTC price dip after key rejection near $89KThe crypto market has experienced volatility and broader financial markets since US President Donald Trump imposed tariffs in early February. However, Trump’s recent comments have traders speculating that he’s softening his stance on the trade war, with some seeing this as bullish for markets.Thielen said the $95,000 price level is a key resistance level for Bitcoin and a “potential trigger point for short-stop liquidations.”He said it could push Bitcoin’s price higher if market strength continues.Magazine: Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of FlameThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.",
      "url": "https://cointelegraph.com/news/bitcoin-price-rally-caution-crypto-analyst-warns-stablecoin-indicator-lagging?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745387470,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474683
    },
    {
      "headline": "U.S. Commerce Secretary Lutnick’s Son Teams Up With Tether, SoftBank for $3B Bitcoin SPAC: FT",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/23/commerce-secretary-lutnick-s-son-teams-up-with-tether-softbank-for-usd3b-bitcoin-spac-ft",
      "source": "CoinDesk",
      "datetime": 1745386256,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/8d6d212b21cf2ae1d307b010b9a78199e960326e-4050x2278.jpg?auto=format",
      "category": "crypto",
      "id": 7474689
    },
    {
      "headline": "Cantor plans $3B crypto venture with SoftBank, Bitfinex and Tether: Report",
      "summary": "Brandon Lutnick, chair of investment banking firm Cantor Fitzgerald, is reportedly partnering with SoftBank, Tether and Bitfinex to create a $3 billion crypto acquisition company.Lutnick and the consortium hope to create a publicly listed crypto acquisition company to capitalize on the market under crypto-friendly US President Donald Trump, and replicate Michael Saylor’s company Strategy, the Financial Times reported on April 23, citing three people who have been briefed on the plan.Cantor Equity Partners raised $200 million in January for the new firm called 21 Capital. At the same time, stablecoin issuer Tether will fork out $1.5 billion in Bitcoin (BTC), Japanese investment holding firm Softbank Group will contribute $900 million, and the crypto exchange Bitfinex will add $600 million.Lutnick’s new venture hopes to raise another $350 million in convertible bonds and a separate $200 million private equity placement to buy additional Bitcoin.Eventually, Tether, Bitfinex, and SoftBank’s Bitcoin investments will be converted into 21 Capital shares, with the value of the Bitcoin locked in at $85,000 per coin and shares costing $10 a pop.However, the deal hasn’t been finalized yet, and some details could change before it’s officially announced. Brandon Lutnick was named chair of Cantor Fitzgerald when his father, Howard Lutnick, stepped down to become the US Secretary of Commerce.Brandon Lutnick was named chair of Cantor Fitzgerald when his father, Howard Lutnick (right), became the US Secretary of Commerce. Source: White HouseCantor Fitzgerald, SoftBank, Tether and Bitfinex didn’t immediately respond to Cointelegraph’s request for comment.Cantor already well versed in crypto market Cantor Fitzgerald has managed Tether’s Treasury portfolio and $134 billion of reserves, mainly in US Treasury bills, since 2021. The firm also owns a 5% stake in the stablecoin issuer.Previously, Cantor acted in an advisory role for Tether’s $775 million investment in YouTube alternative Rumble in December last year.Related: Commerce Secretary Lutnick walks back tariff relief on electronicsMeanwhile, on March 11, Cantor Fitzgerald said it was rolling out a Bitcoin financing business with $2 billion in initial capital to help institutional investors borrow against their crypto holdings. Anchorage Digital and Copper were selected as Bitcoin custodians and collateral managers.Cantor Fitzgerald currently holds over $5 billion worth of assets across 275 total holdings, according to Fintel data.Magazine: XRP win leaves Ripple and industry with no crypto legal precedent set",
      "url": "https://cointelegraph.com/news/cantor-plans-3-billion-crypto-venture-softbank-bitfinex-tether-financial-times?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745385314,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474680
    },
    {
      "headline": "SEC says it won’t re-file fraud case against Hex’s Richard Heart",
      "summary": "The US Securities and Exchange Commission has said it doesn't intend to refile its securities fraud complaint against Hex founder Richard Schueler, who goes by Richard Heart.“Plaintiff Securities and Exchange Commission provides this notice that it does not intend to file an amended complaint in this matter,” the regulator’s lawyer, Matthew Gulde, stated in an April 21 letter to New York District Court Judge Carol Bagley Amon. The court had previously dismissed the SEC’s original complaint on Feb. 28 as Judge Amon said the regulator failed to establish that it had jurisdiction over Heart’s activities, which she said were not specifically targeted at US investors.She granted leave for the SEC to file an amended complaint by March 20, later extending the deadline to April 21.Heart posted to X on April 22 that “Richard Heart, PulseChain, PulseX, and HEX have defeated the SEC completely and have achieved regulatory clarity that nearly no other coins have.”Letter from the SEC to Judge Amon. Source: PACERHeart added that the SEC walked away from some of its other cryptocurrency cases voluntarily, but claimed his was the only case where “the SEC lost and crypto won across the board, with a dismissal in court of every single claim the SEC brought.”Heart said it was a victory for open-source software, cryptocurrency and free speech because the SEC “actually sued software code itself in this case.” SEC hunted Heart in FinlandThe SEC sued Heart in July 2023 for alleged unregistered securities offerings of three tokens, HEX, PulseChain (PLS), and PulseX (PSLX), claiming he made more than $1 billion by touting the tokens as a “pathway to grandiose wealth for investors.”In April 2024, Heart tried to have the suit tossed, claiming the regulator “has no sway over him,” because he didn’t reside in the United States. Related: Finnish police seize watches worth $2.6M from Hex founder Richard Heart: ReportThe SEC opposed this in August, claiming he touted the tokens at a Las Vegas event. In December 2024, Interpol issued a Red Notice for Heart, seeking his arrest in Finland, where he was also suspected of tax evasion. The PulseChain native token (HEX) hit an all-time high of $0.031 in December 2024 but has since tanked 76% as most altcoins have failed to follow Bitcoin’s momentum this year. The SEC has dropped or suspended several cases against crypto firms so far this year under the Trump administration.Magazine: Altcoin season to hit in Q2? Mantra’s plan to win trust: Hodler’s Digest",
      "url": "https://cointelegraph.com/news/sec-wont-retry-fraud-case-against-hex-richard-heart?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745383553,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474677
    },
    {
      "headline": "Tesla holds onto Bitcoin as Musk says time at DOGE to ‘drop significantly’",
      "summary": "Tesla has held onto its Bitcoin during the first quarter of 2025 as CEO Elon Musk promised shareholders that he would scale back his time working as the Trump administration’s cost-cutting czar.Musk’s comment appears to have been the main catalyst behind Tesla’s (TSLA) 5.4% price jump in after-hours trading on April 22 to $250.80 after closing the trading day up 4.6%, according to Google Finance. It comes as the automaker’s Q1 results released the same day show revenues hit $19.34 billion, missing Wall Street estimates by 7.85% and marking a 9.2% fall from the same period last year.Tesla’s net income of $409 million also marked an 80.8% quarter-on-quarter drop and a 70.5% fall from Q1 2024.Source: TeslaTesla’s digital asset holdings dropped 11.61% in value from $1.076 billion to $951 million in Q1, alongside Bitcoin’s (BTC) 11.56% price fall to $82,514 over the same time, according to CoinGecko data.A new rule from the Financial Accounting Standards Board allows public companies to report their crypto holdings at market value. Before, only losses were recorded — unless the crypto was sold. Tesla’s 11,509 Bitcoin stash is now worth over $1.07 billion as a result of the market rebound over the last week, according to Bitcoin Treasuries data. Tesla’s Bitcoin holdings haven’t changed since June 30, 2022.Musk to ease up on DOGE dutiesIn an April 22 earnings call, Musk promised that he would scale back his time working at the Trump administration's so-called Department of Government Efficiency, or DOGE, to focus more on Tesla.“Starting probably next month, May, my time allocation to DOGE will drop significantly,” Musk said. “I’ll be allocating far more of my time to Tesla now that the major work of establishing the Department of Government Efficiency is done.”Musk said he’ll continue to spend “a day or two per week” on DOGE-related matters for as long as US President Donald Trump needs to ensure the “waste and fraud that we stop does not come roaring back.”Related: Peirce signals SEC ‘reorientation’ under new chair Paul AtkinsTesla’s 5.4% rise in after-hours came on the back of a 4.6% increase to nearly $237 during the April 22 trading day as the broader market clawed back some losses from earlier in the week.Tesla shares are still down over 37% year-to-date, driven partially by declining sales, Musk’s increased political presence and economic uncertainty stemming from Trump’s tariffs.Magazine: Crypto fans are obsessed with longevity and biohacking: Here’s why",
      "url": "https://cointelegraph.com/news/tesla-holds-onto-bitcoin-musk-time-doge-to-drop-significantly?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745383010,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474676
    },
    {
      "headline": "Bitcoin price hits 7-week high as Trump softens tone on trade war",
      "summary": "Bitcoin has broken above $93,000 for the first time in seven weeks, extending its post-Easter rally as recent macro events have analysts expecting more upside.Bitcoin (BTC) has climbed 5.62% over the past 24 hours and surpassed $93,000 on April 22 for the first time since March 3, continuing a 12% price rally its seen over the past seven days, according to CoinMarketCap.Bitcoin traders eye “craziest one-minute candle”Bitcoin quickly jumped from just below $91,500 to $93,000 in minutes, leaving traders guessing where the rally could go next.“This is the craziest one-minute candle I’ve ever seen on the Bitcoin chart,” Bitcoin commentator Michael Sullivan said in an April 22 X post.Bitcoin is trading at $92,920 at the time of publication. Source: CoinMarketCapPseudonymous crypto trader Crypto General said Bitcoin “is going as planned, as stated in the last post, a breakout was eyes and today we witnessed our breakout.”Just hours before Bitcoin’s upside swing, crypto commentator “Ted” told his 158,200 X followers that Bitcoin is “going to catch up” with gold and the $100,000 price level, which it hasn’t seen since Feb. 3, is “loading.”It comes amid an improvement in crypto market sentiment, more money flowing into spot Bitcoin exchange-traded funds and US President Donald Trump’s softer tone on the trade war.On the same day, Trump said he had “no intention of firing” US Federal Reserve Chair Jerome Powell after previously criticizing him for not cutting interest rates. It comes only days after Trump called for his termination again in an April 17 Truth Social post, which led to speculation that he would follow through on threats and find a way to remove Powell.Trump just ticked “bullish boxes,” says traderAlongside this, Trump said tariffs on Chinese goods will “come down substantially,” though they “won’t be zero,” which led to an uptick in positive sentiment among crypto analysts.Related: Bitcoin-to-gold ratio risks 35% decline following Wall Street’s $13T wipeoutIn an April 22 X post, economist and crypto trader Alex Kruger said, “Trump just ticked most de-escalation/bullish boxes.” Investing with Brandon said the news was “bullish” too. Meanwhile, the day before, the 11 US spot Bitcoin ETFs saw a joint net inflow of $381.3 million.Traditional financial markets also ended the April 22 trading day in the green, with the S&P 500 up 2.51%, the Nasdaq rising 2.87%, and the Dow Jones gaining 2.66%, according to Google Finance data.Magazine:  Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of FlameThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.Bitcoin has broken above $93,000 for the first time in seven weeks, extending its post-Easter rally as recent macro events have analysts expecting more upside.Bitcoin (BTC) has climbed 5.62% over the past 24 hours and surpassed $93,000 on April 22 for the first time since March 3, continuing a 12% price rally its seen over the past seven days, according to CoinMarketCap.Bitcoin traders eye “craziest one-minute candle”Bitcoin quickly jumped from just below $91,500 to $93,000 in minutes, leaving traders guessing where the rally could go next.“This is the craziest one-minute candle I’ve ever seen on the Bitcoin chart,” Bitcoin commentator Michael Sullivan said in an April 22 X post.Bitcoin is trading at $92,920 at the time of publication. Source: CoinMarketCapPseudonymous crypto trader Crypto General said Bitcoin “is going as planned, as stated in the last post, a breakout was eyes and today we witnessed our breakout.”Just hours before Bitcoin’s upside swing, crypto commentator “Ted” told his 158,200 X followers that Bitcoin is “going to catch up” with gold and the $100,000 price level, which it hasn’t seen since Feb. 3, is “loading.”It comes amid an improvement in crypto market sentiment, more money flowing into spot Bitcoin exchange-traded funds (ETFs), and US President Donald Trump’s softer tone on the trade war.On the same day, Trump said he had “no intention of firing” US Federal Reserve Chair Jerome Powell after previously criticizing him for not cutting interest rates. It comes only days after Trump called for his termination again in an April 17 Truth Social post, which led to speculation that he would follow through on threats and find a way to remove Powell.Trump just ticked “bullish boxes,” says traderAlongside this, Trump said tariffs on Chinese goods will “come down substantially,” though they “won’t be zero,” which led to an uptick in positive sentiment among crypto analysts.Related: Bitcoin-to-gold ratio risks 35% decline following Wall Street’s $13T wipeoutIn an April 22 X post, economist and crypto trader Alex Kruger said, “Trump just ticked most de-escalation/bullish boxes.” Investing with Brandon said the news was “bullish” too. Meanwhile, the day before, the 11 US spot Bitcoin ETFs saw a joint net inflow of $381.3 million.Traditional financial markets also ended the April 22 trading day in the green, with the S&P 500 up 2.51%, the Nasdaq rising 2.87%, and the Dow Jones gaining 2.66%, according to Google Finance data.Magazine:  Former Love Island star’s tips on how to go viral in crypto: Van00sa, X Hall of FlameThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.",
      "url": "https://cointelegraph.com/news/bitcoin-price-seven-week-high-donald-trump-trump-trade-war-tone-ease?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745380516,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474670
    },
    {
      "headline": "Trump Media inks deal with Crypto.com for ‘Made in America’ ETFs",
      "summary": "US President Donald Trump’s media conglomerate, Trump Media and Technology Group, has signed an agreement with crypto exchange Crypto.com to launch exchange-traded funds “with a Made in America focus.”Trump Media, which operates the social media site Truth Social, said on April 22 that it signed a binding agreement with Crypto.com and asset manager Yorkville America Digital to launch ETFs, which “are expected to comprise digital assets as well as securities with a Made in America focus spanning diverse industries such as energy.”The funds will launch through Trump Media’s decentralized finance brand, Truth.Fi, and will be available through Crypto.com’s broker-dealer, Foris Capital. The funds are expected to go live later in 2025, subject to regulatory approval. Trump Media plans to invest some of its cash reserves into the ETFs, which will be launched alongside a number of Truth.Fi Separately Managed Accounts. The US law firm Davis Polk will be advising on the development and launch of the products.The initiative is part of the firm’s financial services and fintech strategy, using up to $250 million custodied by Charles Schwab following a partnership agreement with the bank in January. The finalization of the agreement follows Trump Media and Crypto.com signing a non-binding deal in March.It's set to be the latest crypto-related venture involving Trump and his family. The Trumps helped launch a crypto platform, World Liberty Financial, in October, which has a linked token and plans for a stablecoin.President Trump’s sons, Eric Trump and Donald Trump Jr., have also gone in on a crypto mining venture called American Bitcoin.Spot crypto ETFs rebounding Spot Bitcoin ETFs in the US have seen a turnaround in institutional interest, with more than $1 billion in aggregate inflows so far this week as crypto markets rebounded. Spot Bitcoin ETF flows turn positive. Source: CoinGlassRelated: Trump’s next crypto play will be Monopoly-style game — ReportIt comes after Bitcoin ETFs have been plagued by outflows over the past few weeks as the wider market entered a downturn, as Trump ramped up fears of a trade war with threats of tariffs, which were eventually implemented in early April.Meanwhile, Crypto.com’s native token, Cronos (CRO), has surged 12% after the company inked the deal with Trump Media, reaching $0.09. However, the exchange token remains down 90% from its 2021 all-time high of just under a dollar. Magazine: Altcoin season to hit in Q2? Mantra’s plan to win trust: Hodler’s DigestUS President Donald Trump’s media conglomerate, Trump Media and Technology Group, has signed an agreement with crypto exchange Crypto.com to launch exchange-traded funds (ETFs) “with a Made in America focus.”Trump Media, which operates the social media site Truth Social, said on April 22 that it signed a binding agreement with Crypto.com and asset manager Yorkville America Digital to launch ETFs, which “are expected to comprise digital assets as well as securities with a Made in America focus spanning diverse industries such as energy.”The funds will launch through Trump Media’s decentralized finance brand, Truth.Fi, and will be available through Crypto.com’s broker-dealer, Foris Capital. The funds are expected to go live later in 2025, subject to regulatory approval. Trump Media plans to invest some of its cash reserves into the ETFs, which will be launched alongside a number of Truth.Fi Separately Managed Accounts. The US law firm Davis Polk will be advising on the development and launch of the products.The initiative is part of the firm’s financial services and fintech strategy, using up to $250 million custodied by Charles Schwab following a partnership agreement with the bank in January. The finalization of the agreement follows Trump Media and Crypto.com signing a non-binding deal in March.It's set to be the latest crypto-related venture involving Trump and his family. The Trumps helped launch a crypto platform, World Liberty Financial, in October, which has a linked token and plans for a stablecoin.President Trump’s sons, Eric Trump and Donald Trump Jr., have also gone in on a crypto mining venture called American Bitcoin.Spot crypto ETFs rebounding Spot Bitcoin ETFs in the US have seen a turnaround in institutional interest, with more than $1 billion in aggregate inflows so far this week as crypto markets rebounded. Spot Bitcoin ETF flows turn positive. Source: CoinGlassRelated: Trump’s next crypto play will be Monopoly-style game — ReportIt comes after Bitcoin ETFs have been plagued by outflows over the past few weeks as the wider market entered a downturn, as Trump ramped up fears of a trade war with threats of tariffs, which were eventually implemented in early April.Meanwhile, Crypto.com’s native token, Cronos (CRO), has surged 12% after the company inked the deal with Trump Media, reaching $0.09. However, the exchange token remains down 90% from its 2021 all-time high of just under a dollar. Magazine: Altcoin season to hit in Q2? Mantra’s plan to win trust: Hodler’s Digest",
      "url": "https://cointelegraph.com/news/trump-media-inks-deal-cryptocom-made-in-america-etfs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745378506,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474664
    },
    {
      "headline": "SEC and feds charge man over $200M crypto trading scheme",
      "summary": "The US Securities and Exchange Commission and federal prosecutors have charged a man they allege created a crypto scheme that swindled 90,000 people out of $200 million in the hopes of earning returns from Bitcoin and forex trading.The SEC said on April 22 that it had charged Ramil Palafox, a dual citizen of the US and the Philippines, claiming he misappropriated over $57 million in investor funds gained through his company, PGI Global, between January 2020 and October 2021.The regulator alleged Palafox used a multilevel marketing model to execute a “Ponzi-like” scam until the company’s collapse in 2021. The SEC said he lured investors through “false claims of crypto industry expertise and a supposed AI-powered auto-trading platform.”The SEC claimed Palafox hosted lavish events in Dubai and Las Vegas to recruit new members who were offered referral bonuses to recruit others and used investor funds to pay other investors to further promote the scheme, as well as to line his own pockets.Excerpt from the SEC’s complaint against Ramil Palafox. Source: SEC“Palafox attracted investors with the allure of guaranteed profits from sophisticated crypto asset and foreign exchange trading, but instead of trading, Palafox bought himself and his family cars, watches, and homes using millions of dollars of investor funds,” said Scott Thompson, associate director of the SEC’s Philadelphia office. The SEC is charging Palafox with violating the anti-fraud and registration provisions of the federal securities laws and is seeking a permanent injunction to ban him from the future sale of securities and crypto assets, repayment of ill-gotten gains and civil penalties. Justice Department files twin actionThe SEC’s complaint is running parallel to action brought by the US Attorney’s Office for the Eastern District of Virginia, which arraigned Ramil Palafox on criminal charges. According to an indictment filed under seal on March 13, federal prosecutors charged Palafox with wire fraud, money laundering and unlawful monetary transactions.Prosecutors alleged Palafox misled investors with false promises of daily returns ranging from 0.5% to 3% from Bitcoin trading and hid information about PGI’s profitability, licenses, and business activity. The indictment said Palafox told investors that substantial returns were being generated via the company’s crypto exchanges and that “his traders were able to make money regardless of whether the price of Bitcoin was going up or down.” However, the Justice Department alleged that, in reality, most investors' money was never used to buy or trade Bitcoin, and many lost some or all of their funds.Property listed in the indictment that would be forfeited by Palafox if convicted includes over $1 million in cash, 17 vehicles, including two Teslas, a Ferrari 458 Special, two Lamborghinis, and two Porsches, plus a variety of designer bags, wallets, shoes, jewellery and watches.Related: Crypto crime goes industrial as gangs launch coins, launder billions — UNVarious linked companies were included in the scheme, including the Praetorian Group International Trading Inc., the website for which was seized by the Department of Justice in 2021, leading to its UK-based operations being shut down by the UK’s High Court.  It’s the agency’s first crypto-related case under its crypto-friendly SEC chair, Paul Atkins, who was sworn in on April 22.The SEC had brought a case against Nova Labs in January, accusing it of selling unregistered securities by offering devices that mined the Helium (HNT) token. The SEC reached a settlement with Nova Labs in April that resulted in the lawsuit being dismissed and a $200,000 civil penalty.Magazine: Uni students crypto ‘grooming’ scandal, 67K scammed by fake women: Asia Express",
      "url": "https://cointelegraph.com/news/sec-feds-lay-charges-200m-crypto-scheme?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745377797,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474665
    },
    {
      "headline": "Australia’s top court sides with Block Earner, dismisses financial regulator&#039;s suit",
      "summary": "The Federal Court of Australia has sided with fintech firm Block Earner in an appeal against a ruling that found it was required to hold a financial services license for its now-discontinued crypto-related products. Block Earner’s crypto-linked fixed-yield earning product is not a financial product, or a managed investment scheme, and is not a derivative under the Corporations Act, Justices David O’Callaghan, Wendy Abraham and Catherine Button said in an April 22 judgment. The trio said Block Earner’s yield product couldn’t be classed as an investment or financial product because users loaned crypto under fixed terms for interest payments and didn’t pool contributions to generate further benefits. The terms and conditions framed it as a loan, and users had no exposure to the firm’s business outside of the agreed interest rate, they added.A court has dismissed the legal proceedings against Block Earner and ordered Australia's financial regulator to pay costs. Source: ASICThe Australian Securities and Investment Commission (ASIC), which first brought the case, has been ordered by the court to pay costs for the proceedings, including appeals. The regulator said in an April 22 press release that it is currently “considering this decision.”Block Earner’s chief commercial officer, James Coombes, told Cointelegraph the court decision brings clarity that crypto assets shouldn’t be treated differently from other asset classes when applying existing laws. “Our product was simply defined as one where customers would lend their assets to us for a fixed return, there was no share in the upside of the pool of assets and as such no Managed Investment Scheme existed,” he said. “The fact that it included crypto assets should not alter that simple definition, and I believe this case forms a bedrock for ambitious brands around Australia to build from.”An ASIC spokesperson declined further comment.Earner product won’t make a return Despite the win in court, Block Earner will not be reviving its Earner product after axing it when legal proceedings began, but Coombes said that “crypto-backed loans products remain the core focus of the company.”“Regulation going forward is not an easy task, and we empathise with the regulators on this point,” Coombes added. “We hope a collaborative process can bring about positive change.” Related: Australia outlines crypto regulation plan, promises action on debankingASIC launched civil legal proceedings in November 2022, arguing that Block Earner needed an Australian Financial Services License to offer its three crypto-linked fixed-yield earning products.In February 2024, an Australian court initially found the fintech firm would need a financial services license to operate its crypto yield-bearing products. Another June 2024 ruling released Block Earner from any financial penalties because it had “acted honestly” and pursued its legal opinions before launching the products, which ASIC appealed.Magazine: SEC’s U-turn on crypto leaves key questions unanswered",
      "url": "https://cointelegraph.com/news/australia-court-sides-block-earner-dismissing-asic-lawsuit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745377133,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474666
    },
    {
      "headline": "Former SEC Chair Jay Clayton sworn in as interim US attorney for Manhattan",
      "summary": "Former SEC Chair Jay Clayton confirmed that he has been appointed as the interim US Attorney for the Southern District of New York after the Democratic Party’s Senate leader used a “blue slip” to block a vote confirming Clayton’s position.The appointment comes a little over five months after US President Donald Trump nominated Clayton to take on the role. He replaces Damian Williams, who played a major role in the conviction of former FTX CEO Sam Bankman-Fried and other high-profile crypto cases.Clayton said on April 22 his top priorities would be to protect public safety, ensure the integrity of the US financial system, defend national security interests and combat fraud, particularly against the elderly and most vulnerable.The temporary nature of Clayton’s appointment resulted from Democrat Senate Minority Leader Chuck Schumer’s use of a blue slip to block Clayton’s confirmation on April 16, effectively preventing a Senate vote and official confirmation of his position. Blue slips can be used by senators to block US attorney or district court judicial nominees in their home states. Clayton is allowed to serve as interim US attorney for up to 120 days without Senate confirmation. After that, he will need to be approved in a Senate vote or receive a temporary extension of his interim status from Manhattan’s federal court.Trump criticized Schumer’s move in an April 17 Truth Social post, pointing out that Clayton received bipartisan support in the Senate and that Clayton complied with all requests asked of him.Source: Donald TrumpThe interim status of Clayton’s position will last until around Aug. 20. The role will see him as the top law enforcement officer for New York’s Southern District, encompassing the counties of New York, Bronx, Westchester, Rockland, Putnam, Orange, Dutchess and Sullivan.The Southern District of New York is the oldest federal court district in the US, and its location in the country’s financial epicenter means it often handles high-profile cases involving white-collar crime.Clayton has shared mostly positive views on cryptoClayton served as SEC chair between May 4, 2017, and Dec. 23, 2020, and brought 56 cases against crypto firms during his tenure.Related: Oregon AG lawsuit against Coinbase calls XRP unregistered securityHe stated in a December 2021 CNBC interview that he’s a “huge believer in crypto technology,” adding that “the efficiency benefits in the financial system and otherwise from tokenization are immense.”Clayton has also praised Bitcoin (BTC) as a prominent store of value, but didn’t allow Bitcoin exchange-traded products during his time as SEC chair.The first US Bitcoin investment product was approved in 2021 under former SEC Chair Gary Gensler.Magazine: XRP win leaves Ripple and industry with no crypto legal precedent set",
      "url": "https://cointelegraph.com/news/ex-sec-chair-jay-clayton-interim-manhattan-us-attorney?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745369511,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474652
    },
    {
      "headline": "Chiliz meets with SEC Crypto Task Force amid US market reentry plans",
      "summary": "Chiliz, a SportsFi company, has met with the United States Securities and Exchange Commission (SEC) to discuss an investment and reentry into the US crypto market under the crypto-friendly White House and increased push for regulatory clarity surrounding digital assets.According to the meeting request made public by the SEC, Chiliz plans a reentry into the US market around the time of the 2026 FIFA World Cup international football (soccer) tournament. The comeback would be accompanied by a $50 million to $100 million investment in the local market. National Basketball Association and National Football League teams are said to be interested in launching fan tokens if regulatory clarity improves.The meeting with the federal agency was held on April 22 — the same day Chiliz CEO Alexandre Dreyfus shared a photo with Bo Hines, executive director of Trump’s Council of Advisors for Digital Assets, suggesting a second meeting with White House officials.Source: Alexandre DreyfusAccording to the meeting document, Chiliz discussed the proposed structure of a fan token and why “it should not be classified as a security.” Broadly, a security is an investment wherein the investor expects a profit due to the efforts of someone other than the investor.Whether cryptocurrencies and related assets are securities has been a key issue in the regulation of Web3 within the United States.Related: Chiliz’ Socios.com secures in-principle license approval in MaltaChiliz ecosystem sees lower TVL in 2025Chiliz, despite its partnerships with football clubs, gaming teams, and racing companies, has seen a significant drop in activity within its ecosystem. DefiLlama data shows the protocols’ total value locked has fallen from $17.8 million on Dec. 9, 2024, to $6.5 million on April 22, 2025, marking a 63.5% drop.Chiliz TVL. Source: DefiLlamaIts governance token hasn’t fared particularly well, either. According to CoinMarketCap, the Chiliz (CHZ) token price has declined 67% over the past 12 months. The company is known for its fan tokens, which allow enthusiasts to own the official cryptocurrencies of their favorite sports clubs.The company has made headway into the soccer market, partnering with Football Club Barcelona, Paris Saint-Germain, and Manchester City, among others.Related: FIFA launches NFT collection amid 2023 Club World CupChiliz invested $80 million in partnerships within the US market in 2021, the document shows. However, regulatory uncertainty and the fallout from FTX’s collapse led to a “strategic exit” in the following year.The next World Cup is expected to take place in June 2026. The United States will be the main host of the tournament, while Canada and Mexico will act as auxiliary hosts.Magazine: ‘Normie degens’ go all in on sports fan crypto tokens for the rewardsChiliz, a SportsFi company, has met with the United States Securities and Exchange Commission (SEC) to discuss an investment and reentry into the US crypto market under the crypto-friendly White House and increased push for regulatory clarity surrounding digital assets.According to the proposed meeting request made public by the SEC, Chiliz plans a reentry into the US market around the time of the 2026 FIFA World Cup. The comeback would be accompanied by a $50 million to $100 million investment in the local market. NBA and NFL teams are allegedly interested in launching fan tokens if regulatory clarity improves.The meeting with the federal agency was held on April 22 — the same day Chiliz CEO Alexandre Dreyfus shared a photo with Bo Hines, executive director of Trump’s Council of Advisors for Digital Assets, suggesting a second meeting with White House officials.  Source: Alexandre DreyfusAccording to the meeting document, Chiliz discussed the proposed structure of a fan token and why “it should not be classified as a security.” Broadly, a security is an investment wherein the investor expects a profit due to the efforts of someone other than the investor.Whether cryptocurrencies and related assets are securities has been a key issue in the regulation of Web3 within the United States.Related: Chiliz’ Socios.com secures in-principle license approval in MaltaChiliz ecosystem sees lower TVL in 2025Chiliz, despite its partnerships with football clubs, gaming teams, and racing companies, has seen a significant drop in activity within its ecosystem. DefiLlama data shows the protocols’ total value locked has fallen from $17.8 million on Dec. 9, 2024, to $6.5 million on April 22, 2025, marking a 63.5% drop.Chiliz TVL. Source: DefiLlamaIts governance token hasn’t fared particularly well either. According to CoinMarketCap, the Chiliz (CHZ) token price has declined 67% over the past 12 months. The company is known for its fan tokens, which allow enthusiasts to own the official cryptocurrencies of their favorite sports clubs.The company has made headway into the soccer market, partnering with Football Club Barcelona, Paris Saint-Germain, and Manchester City, among others.Related: FIFA launches NFT collection amid 2023 Club World CupChiliz invested $80 million in partnerships within the US market in 2021, the document shows. However, regulatory uncertainty and the fallout from FTX’s collapse led to a “strategic exit” in the following year. The next World Cup is expected to take place in June 2026. The United States will be the main host of the tournament, while Canada and Mexico will act as auxiliary hosts. Magazine: ‘Normie degens’ go all in on sports fan crypto tokens for the rewards",
      "url": "https://cointelegraph.com/news/chiliz-meets-sec-crypto-task-force-us-market-reentry?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745359219,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474631
    },
    {
      "headline": "XRP Ledger Foundation spots ‘crypto stealing backdoor’ in code library",
      "summary": "The XRP Ledger Foundation has identified a “serious vulnerability” in the official JavaScript library used for interacting with the XRP Ledger blockchain network, the nonprofit said.On April 22, blockchain security specialist Aikido said in a blog post that XRP Ledger’s open-source JavaScript library was “compromised by sophisticated attackers who put in a backdoor to steal cryptocurrency private keys and gain access to cryptocurrency wallets.” The JavaScript library includes programs enabling developers to interact with the XRP Ledger and is distinct from the blockchain network itself. ‘“[T]his package is used by hundreds of thousands of applications and websites making it a potentially catastrophic supply chain attack on the cryptocurrency ecosystem,” Aikido said. The XRP Ledger Foundation has already upgraded the code repository to “remove the previously compromised version,” it said in an April 22 post on the X platform.Aikido identified unusual code in XRP’s JavaScript package. Source: AikidoRelated: Coinbase Derivatives lists XRP futuresIt added that several XRP Ledger ecosystem projects — including XRPScan, First Ledger, and Gen3 Games — confirmed that they were not impacted by the incident. The XRP (XRP) token ended the US trading day up more than 3.5% despite news of the security breach, according to CoinGecko. The token has a market capitalization of more than $125 billion and a fully diluted value of approximately $215 billion. XRP’s token price on April 22. Source: CoinGeckoInstitutional adoptionLaunched in 2012, XRP Ledger is among the oldest blockchain networks and specializes in payments and decentralized finance (DeFi) applications for institutions. It has been gaining prominence in recent months as a friendlier US regulatory environment paves the way for broader institutional adoption of the network’s token and ecosystem projects. The XRP token’s price increased by upward of 300% after crypto-friendly US President Donald Trump prevailed in the November presidential election, according to CoinGecko. Since then, several asset managers have asked the US Securities and Exchange Commission (SEC) to approve US-listed exchange-traded funds (ETFs) holding the XRP token. On April 21, Coinbase listed futures contracts for the XRP token on its US derivatives exchange. Magazine: Crypto ‘more taboo than OnlyFans,’ says Violetta Zironi, who sold song for 1 BTC",
      "url": "https://cointelegraph.com/news/xrp-ledger-foundation-spots-crypto-stealing-backdoor-javascript-package?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745358458,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474628
    },
    {
      "headline": "Tesla Reports $951M in Crypto Holdings as it Misses Earnings",
      "summary": "",
      "url": "https://www.coindesk.com/markets/2025/04/22/tesla-reports-951m-in-crypto-holdings-as-it-misses-earnings",
      "source": "CoinDesk",
      "datetime": 1745357039,
      "date": "2025-04-23",
      "related": "",
      "image": "https://cdn.sanity.io/images/s3y3vcno/production/6e76e68756fb1b0a0ae4d11f0f654964d362df43-2861x1907.jpg?auto=format",
      "category": "crypto",
      "id": 7474636
    },
    {
      "headline": "Bitcoin analysts target $95K as Trump’s trade war cools — Do BTC futures agree?",
      "summary": "Bitcoin (BTC) surged to a 45-day high above $91,000 on April 22, and the upward movement coincided with gold reaching a new all-time high. The price gains reflect investors' concerns over a potential economic recession amid ongoing global trade tensions.The tides are shifting, but does data support a Bitcoin price rally above $95,000?Bitcoin 2-month futures annualized premium. Source: Laevitas.chIn neutral markets, the Bitcoin futures premium typically ranges between 5% and 10% to compensate for the longer settlement period. At present, the annualized premium stands at 6%, which is not considered particularly bullish, even though BTC appreciated by $6,840 between April 20 and April 22. Some analysts interpret this as a sign that Bitcoin is beginning to decouple from the stock market.Traders’ PTSD could emerge around BTC’s $90K zonePart of this skepticism among traders stems from Bitcoin’s repeated inability to sustain levels above $90,000 in early March. For example, Bitcoin tested the $95,000 mark on March 3, only to fall to $81,464 the following day. This inconsistent performance since the $109,346 peak on Jan. 20 has contributed to a lack of conviction among bullish investors, especially as gold has continued to set new all-time highs during the same period.S&P 500 futures (left) vs. Bitcoin/USD. Source: TradingView / CointelegraphCurrently, Bitcoin is trading 16% below its all-time high, a figure that closely mirrors the S&P 500’s decline of 14.5%. This suggests that the recent era of excessive risk-taking may be behind us. Notably, even at its lowest point below $75,000, Bitcoin’s 32% drawdown was less severe than those experienced by Nvidia (NVDA), Amazon (AMZN), Facebook (META), and Tesla (TSLA).Comments from US Treasury Secretary Scott Bessent on April 22 contributed to easing investor concerns. As reported by Bloomberg, Bessent described the ongoing tariff standoff with China as “unsustainable,” suggesting an increased likelihood of de-escalation. In contrast, US President Donald Trump took to social media to assert that US Federal Reserve Chair Jerome Powell is hindering economic growth by not reducing interest rates.Bitcoin’s gains contrast with investors’ shift to government bondsRegardless of where the blame lies for the subdued economic growth in the United States, demand for short-term US Treasurys has risen, as evidenced by the yield on the 2-year note declining to 3.81% from 4.04% a month earlier. Essentially, investors are accepting lower returns in exchange for the perceived safety of government bonds. Against this backdrop, Bitcoin’s 6.3% price increase over the past 30 days stands out as particularly notable.To determine whether these recent gains have affected professional traders’ sentiment, it is important to examine the BTC options markets. If traders expect a correction, put (sell) options tend to trade at a premium, causing the 25% delta skew metric to rise above 6%. Conversely, bullish sentiment pushes the indicator below -6%.Bitcoin 30-day options skew (put-call) at Deribit. Source: Laevitas.chCurrently, the Bitcoin options market reflects limited enthusiasm following the recent surge to $91,000, with the 25% delta skew indicator at -2%, which remains within the neutral range. According to this metric, the last period of bullish sentiment occurred on Jan. 30, when Bitcoin traded near $105,000. Therefore, there is no clear evidence that large investors or market makers are anticipating a sustained rally above $95,000.Related: Institutional demand could push BTC past $200k in 2025 — AnalystsDespite some weak macroeconomic data, market participants expect a relatively strong first-quarter earnings season. FactSet reports that the “Magnificent 7” companies are projected to achieve earnings growth of 14.8% for the first quarter compared to the prior year.While Bitcoin still has a reasonable chance of revisiting $95,000 or higher, many traders appear to be waiting for further developments in the US-China trade war before placing additional bullish bets.This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
      "url": "https://cointelegraph.com/news/bitcoin-analysts-target-95k-as-trump-s-trade-war-cools-do-btc-futures-agree?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "Cointelegraph",
      "datetime": 1745356873,
      "date": "2025-04-23",
      "related": "",
      "image": "https://static2.finnhub.io/file/publicdatany/hmpimage/cointelegraph.webp",
      "category": "crypto",
      "id": 7474621
    }
  ]
}